{
  "subject": "Chemistry",
  "code": "chem",
  "topic": "Short Notes",
  "metadata": {
    "description": "A sample Quick study notes to boost your understanding. Get more questions and answers from K.C.S.E past papers at a cost of 150Kes per set",
    "level": "KCSE",
    "last_updated": "2025-10-07",
    "type": "notes"
  },
  "notes": [
    {
      "id": 1,
      "title": "Enthalpy-Contents: Definitions, Calorimetry, Hess's law, Bond energies, Worked examples",
      "content": "Enthalpy-Contents: Definitions, Calorimetry, Hess's law, Bond energies, Worked examples\n1. What is Enthalpy (H)?\nEnthalpy (H) is a thermodynamic quantity representing the total heat content of a\nsystem at constant pressure. In KCSE you will deal with enthalpy changes (∆H) for\nchemical reactions, which indicate heat released or absorbed under constant\npressure.\n\n\n2. Enthalpy change (∆H) — definition & sign convention\n∆H = H(products) − H(reactants).\n- If ∆H is negative (∆H < 0): the reaction is exothermic — heat is released to the\nsurroundings (temperature of surroundings rises).\n- If ∆H is positive (∆H > 0): the reaction is endothermic — heat is absorbed from\nthe surroundings (temperature of surroundings falls).\n\n\n3. Common types of enthalpy changes (KCSE focus)\n- Enthalpy of combustion (∆Hc): heat change when 1 mole of substance burns\ncompletely in oxygen (usually very negative/exothermic).\n- Enthalpy of formation (∆Hf): heat change when 1 mole of a compound is formed from\nits elements in their standard states (standard ∆Hf of an element = 0).\n- Enthalpy of neutralisation (∆Hn): heat change when an acid and base react to form\n1 mole of water (usually about −57 kJ mol■¹ for strong acid + strong base).\n- Enthalpy of reaction: general term for any reaction under specified conditions.\n\n\n4. Standard conditions & notation\nStandard enthalpy changes are measured under standard conditions: 1 atm (or 100\nkPa) pressure and a stated temperature (usually 298 K = 25°C). Notation often\nincludes a superscript '°' as in ∆H° (standard enthalpy change).\n\n\n5. Calorimetry — measuring ∆H in the lab (simple calorimeter)\nBasic principle: measure temperature change of known mass of solution (assumed to\nhave heat capacity close to water) and relate heat gained/lost to m·c·∆T.\nMain formula: q = m × c × ∆T\n- q is heat absorbed or released (J)\n- m is mass of substance heated (g) — often mass of solution (assume density = 1 g\ncm■³)\n- c is specific heat capacity (water ≈ 4.18 J g■¹ K■¹)\n- ∆T is change in temperature (K or °C)\nTo find molar enthalpy change (kJ mol■¹):\n1. Calculate q (J) for the solution (use m and ∆T).\n2. Convert q to kJ (divide by 1000).\n3. Divide by moles of limiting reactant to get kJ per mole. Use sign convention\n(exothermic → negative ∆H).\nExample: Mixing 50.0 cm³ of 1.0 mol dm■³ HCl with 50.0 cm³ of 1.0 mol dm■³ NaOH,\ntemperature rises from 20.0°C to 25.5°C. Calculate ∆Hn.\nSolution outline:\n- Total mass ≈ 100.0 g; ∆T = 5.5°C; q = 100 × 4.18 × 5.5 = 2299 J = 2.299 kJ.\n- Moles of limiting reactant = 0.050 mol (from 50 cm³ × 1.0 mol dm■³).\n- ∆H per mole = -2.299 / 0.050 = -45.98 kJ mol■¹ (approx. -46.0 kJ mol■¹).\n\n\n6. Bomb calorimeter & combustion enthalpies (brief)\nA bomb calorimeter measures heat of combustion at constant volume. The heat\nreleased raises the temperature of the calorimeter (including water jacket).\nCorrection for calorimeter heat capacity (calibration constant) is required. KCSE\nusually focuses on simple q = mc∆T and not full bomb calorimetry details.\n\n\n7. Hess's Law (additivity of enthalpy changes)\nHess's law: The total enthalpy change for a reaction is the same whether the\nreaction occurs in one step or several steps. Enthalpy is a state function.\nUse Hess's law to calculate enthalpy changes that are difficult to measure directly\nby combining known enthalpy changes (reverse sign when reversing equations;\nmultiply ∆H when scaling equations).\nExample:\nGiven: C(s) + O2(g) → CO2(g) ∆H = -394 kJ\n2CO(g) + O2(g) → 2CO2(g) ∆H = -566 kJ\nFind ∆H for: C(s) + 1/2 O2(g) → CO(g).\nApproach: manipulate given equations (reverse/halve) and add; final ∆H = -110 kJ\n(worked example left for practice).\n\n\n8. Bond energies (using average bond enthalpies)\nBond enthalpy method estimates ∆H by breaking bonds in reactants and forming bonds\nin products:\n∆H ≈ Σ(Bond energies of bonds broken) − Σ(Bond energies of bonds formed).\nThis uses average bond energies (not exact for all molecules) but is useful for\nestimating and KCSE-level questions.\n\n\n9. Enthalpy profile diagrams (energy vs reaction coordinate)\nAn enthalpy profile diagram shows enthalpy of reactants and products and activation\nenergy barrier.\n- Label reactants, products, ∆H (vertical difference), and activation energy (peak\nabove reactants).\n- Exothermic: products lower than reactants (∆H negative). Endothermic: products\nhigher (∆H positive).\n\n\n10. Worked examples (short & useful)\n1) Calculate ∆H for reaction given q and moles:\n- If q (heat absorbed by solution) = +1500 J when 0.025 mol reacted, then ∆H =\n-1500 J / 0.025 mol = -60000 J mol■¹ = -60.0 kJ mol■¹ (negative because heat\nreleased by reaction).\n2) Using Hess's law:\nGiven: A → B ∆H1 = +100 kJ\nB → C ∆H2 = -170 kJ\nFind A → C: ∆H = ∆H1 + ∆H2 = -70 kJ.\n\n\n11. Experimental errors & how to reduce them\nCommon sources of error in calorimetry:\n- Heat loss to surroundings (use lid, insulate, correct for calorimeter heat\ncapacity).\n- Incomplete reaction or evaporation of volatile reactants.\n- Assuming solution density/heat capacity equal to water introduces small errors.\nHow to reduce errors:\n- Use polystyrene cup calorimeter with lid; minimize stirring time between\ntemperature readings and mixing; repeat and average results; use appropriate blank\nexperiments to correct for heat loss.\n\n\n12. Practical reporting (KCSE-style)\nWhen answering practical/calculation questions include: apparatus, measurements\n(volumes, masses, temperatures), calculations step-by-step (show q = mc∆T),\nconversion to kJ mol■¹, sign of ∆H, and a clear conclusion\n(exothermic/endothermic).\n\n\n13. Common mistakes & tips\n- Forgetting to give ∆H per mole (express in kJ mol■¹) when asked.\n- Wrong sign convention: remember exothermic = negative ∆H.\n- Using mass of solution incorrectly — use total mass of mixture when finding q.\n- Not converting J → kJ before dividing by moles (or wrong units).\nKCSE tip: Write the formula q = m c ∆T as your first calculation step and state\nunits clearly.\n\n\n14. Short study plan\n- Memorise definitions (enthalpy, ∆H, exothermic, endothermic, Hess's law).\n- Practice at least 6 calorimetry calculations (mixing, neutralisation, limited\ncombustion examples).\n- Practice 4 Hess's law questions manipulating equations and ∆H values.\n- Revise enthalpy profile diagrams and bond enthalpy calculations."
    },
    {
      "id": 2,
      "title": "Electrolysis-Contents: Definitions, electrolytes, electrode reactions, examples, calculations",
      "content": "Electrolysis-Contents: Definitions, electrolytes, electrode reactions, examples, calculations\n1. What is Electrolysis?\nElectrolysis is the chemical decomposition of an ionic compound (molten or in\nsolution) by passing an electric current through it. It involves oxidation at the\nanode and reduction at the cathode.\n\n\n2. Basic terms\n- Electrolyte: ionic substance that conducts electricity when molten or in\nsolution.\n- Electrodes: conductors (usually metal or inert carbon) connected to the external\ncircuit; anode is positive, cathode is negative.\n- Anode: electrode where oxidation occurs (loss of electrons).\n- Cathode: electrode where reduction occurs (gain of electrons).\n- Anion: negative ion (moves to anode). Cation: positive ion (moves to cathode).\n\n\n3. Direction of ion movement & electron flow\n- Cations move to the cathode and gain electrons (reduction).\n- Anions move to the anode and lose electrons (oxidation).\n- Electrons flow from the external circuit into the cathode and leave the anode\nback into the external circuit.\n\n\n4. Electrolysis of molten ionic compounds (general)\nWhen molten, ions are free (no water present). Electrolysis of molten salts gives\nthe elements.\nExample: molten sodium chloride (NaCl):\n- At cathode: Na+ + e− → Na(l) (reduction)\n- At anode: 2Cl− → Cl2(g) + 2e− (oxidation)\nOverall: 2NaCl(l) → 2Na(l) + Cl2(g)\n\n\n5. Electrolysis of aqueous solutions — competition with water\nIn aqueous solutions, water can also be oxidised/reduced. Which species is\ndischarged depends on:\n- Electrode material (inert vs reactive)\n- Relative ease of discharge (reduction potential)\n- Concentration of ions\nCommon outcomes:\n- Aqueous NaCl (brine) with inert electrodes: at cathode, H2 produced (not Na)\nbecause water is easier to reduce; at anode, Cl2 is produced (if Cl− concentration\nhigh).\n- Aqueous CuSO4 with inert Pt electrodes: at cathode Cu2+ + 2e− → Cu(s) (copper\ndeposits); at anode, water may oxidise to O2 unless anode is copper (reactive) when\nCu metal dissolves to give Cu2+.\n\n\n6. Example: Electrolysis of aqueous copper(II) sulfate with inert electrodes\nElectrolyte: CuSO4(aq)\n- Cathode (reduction): Cu2+ + 2e− → Cu(s) (copper coats the cathode)\n- Anode (oxidation, inert electrode like Pt): 2H2O → O2 + 4H+ + 4e− (oxygen\nevolves)\nObservation: copper deposits at cathode; oxygen bubbles at anode; solution becomes\nacidic (H+ increases).\n\n\n7. Example: Electrolysis of copper(II) sulfate with copper electrodes (purification of cop\nUsing a pure copper anode and impure copper cathode (electrorefining):\n- At anode: impure copper → Cu2+ + 2e− (anode dissolves)\n- At cathode: Cu2+ + 2e− → Cu(s) (pure copper plates out)\nImpurities (e.g., Ag, Au) fall off as anode sludge. This is industrially important\nfor refining copper.\n\n\n8. Chlor-alkali process (industrial electrolysis of brine)\nElectrolysis of concentrated NaCl solution (brine) produces Cl2, H2 and NaOH (in\ndifferent cell designs):\n- Overall simplified relations:\nAt cathode: 2H2O + 2e− → H2(g) + 2OH−\nAt anode: 2Cl− → Cl2(g) + 2e−\nNet effect: Cl2(g), H2(g) and NaOH(aq) (used industrially). Various cell types\n(mercury cell, diaphragm cell, membrane cell) separate products to avoid\nrecombination.\n\n\n9. Electroplating & uses\nElectroplating: coating an object with a thin layer of metal using electrolysis\n(improves appearance, prevents corrosion).\nSetup: object to be plated is cathode, metal to plate with is anode or metal ions\npresent in solution.\nExample: silver plating of spoons, copper plating of iron objects.\nOther uses: extraction of reactive metals (electrolytic reduction),\nelectrorefining, production of gases, manufacture of NaOH, chlor-alkali industry.\n\n\n10. Faraday's laws (simple KCSE-level treatment) & calculations\nFaraday's first law (qualitative): Mass of substance deposited or liberated is\nproportional to the quantity of electricity passed (charge Q).\nBasic relation: Q = I × t (Q in coulombs, I in amperes, t in seconds).\nFor simple KCSE calculations you may use:\n- m ∝ Q and m = (Q × M) / (n × F) where M is molar mass, n is number of electrons\nexchanged per ion, and F (Faraday constant) ≈ 96500 C mol■¹.\nOften exam questions give simplified values or ask to show proportionality;\nremember Q = It is essential.\n\n\n11. Worked calculation example (mass of copper deposited)\nExample: A current of 2.0 A is passed through a solution of CuSO4 for 30 minutes.\nCalculate mass of copper deposited. (Cu2+ + 2e− → Cu)\nSolution outline:\n- Q = I × t = 2.0 A × (30 × 60) s = 2 × 1800 = 3600 C\n- Moles of electrons = Q / F ≈ 3600 / 96500 ≈ 0.0373 mol e−\n- For Cu2+, 2 mol e− deposit 1 mol Cu. Moles Cu = (moles e−) / 2 ≈ 0.01865 mol\n- Mass = moles × M(Cu = 63.5) ≈ 0.01865 × 63.5 ≈ 1.18 g\nKCSE tip: show Q = It, relate electrons to moles, then to mass; examiner awards\nmethod marks.\n\n\n12. Factors affecting electrolysis\n- Current (I): higher current → more charge passed per time → greater mass\ndeposited per unit time.\n- Time (t): longer time increases total charge Q = It.\n- Concentration of ions: abundant ions favor their discharge; low concentration may\nlead to water discharge instead.\n- Electrode material: reactive vs inert electrodes affect which species appear at\nelectrodes.\n- Temperature: may slightly affect rates and conductivity; generally higher temp\nimproves ionic mobility.\n\n\n13. Apparatus & KCSE practicals\nTypical school electrolysis apparatus: power supply (DC), electrodes (inert carbon\nor metal), electrolyte (aqueous or molten), ammeter, voltmeter, beakers and gas\ncollection (delivery tubes).\nKCSE practicals often ask:\n- Describe apparatus and procedure\n- State observations (bubbles, metal deposition, colour changes)\n- Write electrode equations and overall equation\n- Explain why a particular gas forms (relative ease of discharge)\n\n\n14. Safety & environmental notes\n- Handle electrolytes (acids/alkalis) with care; wear goggles and gloves.\n- Chlorine gas (from brine electrolysis) is toxic — ensure good ventilation.\n- Strong currents and heat from apparatus can be hazardous; use appropriate\nprotection.\n- Industrial electrolysis consumes large energy; environmental footprint depends on\nelectricity source.\n\n\n15. Common exam pitfalls & tips\n- Forgetting to show electron transfer at electrodes (include half-equations).\n- Confusing anode/cathode (remember OIL RIG: oxidation is loss, reduction is gain;\nreduction at cathode).\n- Not accounting for water discharge in aqueous solutions — consider standard\nelectrode potentials qualitatively.\n- For calculations, always show Q = It, convert units (minutes → seconds), and\nrelate moles of e− to moles of substance.\n\n\n16. Short revision checklist\n- Define electrolysis and know oxidation/reduction at electrodes.\n- Practice writing half-equations and overall equations for common electrolyses\n(molten NaCl, CuSO4(aq), brine).\n- Do at least 3 KCSE-style calculation questions using Q = It and Faraday\nrelations.\n- Be ready to describe apparatus, procedure, observations and safety in practical\nquestions."
    },
    {
      "id": 3,
      "title": "The Contact Process (Manufacture of Sulfuric Acid)-Contents: SO2 production, purification, contact stage, oleum, conditi",
      "content": "The Contact Process (Manufacture of Sulfuric Acid)-Contents: SO2 production, purification, contact stage, oleum, conditions, hazards\n1. Overview — What is the Contact Process?\nThe Contact Process is the industrial method for producing concentrated sulfuric\nacid (H2SO4). It involves converting sulfur (or sulfide ores) to sulfur dioxide\n(SO2), oxidising SO2 to sulfur trioxide (SO3) using a vanadium(V) oxide catalyst,\nand then converting SO3 into sulfuric acid (via oleum) to avoid direct combination\nwith water.\n\n\n2. Main stages (summary)\n1. Production of sulfur dioxide (SO2): burning sulfur or roasting sulfide ores.\nS(s) + O2(g) → SO2(g)\n4FeS2 + 11O2 → 2Fe2O3 + 8SO2 (roasting of pyrite)\n2. Purification of SO2 (removal of impurities): remove dust, arsenic compounds,\nNOx, and moisture because they poison the catalyst.\n3. Catalytic oxidation of SO2 to SO3 (contact stage):\n2SO2(g) + O2(g) ■ 2SO3(g) ∆H = −198 kJ mol■¹ (exothermic)\nCatalyst: V2O5 (vanadium(V) oxide) on a porous support. Typical conditions:\n~450°C, low pressure (near 1 atm), and excess oxygen. Separate catalyst beds and\nheat exchange are used.\n4. Absorption of SO3 into sulfuric acid to form oleum, then dilution to give\nconcentrated H2SO4:\nSO3(g) + H2SO4(l) → H2S2O7 (oleum)\nH2S2O7 + H2O → 2H2SO4\nDirectly adding SO3 to water is avoided because it forms a fine mist (dangerous and\ndifficult to condense).\n\n\n3. Purification (why & how)\nSO2 from combustion/roasting contains impurities like dust, ash, arsenic oxides,\nand NOx. These must be removed because:\n- Dust/ash can block equipment and reduce efficiency.\n- Arsenic compounds and other impurities poison the V2O5 catalyst, reducing\nactivity.\nTypical purification steps:\n- Cooling and dust removal (electrostatic precipitators or filters)\n- Removal of SO3 and NO2 traces by washing with water or alkali and further\nscrubbing\n- Drying (use concentrated H2SO4) to remove moisture before the contact stage.\n\n\n4. The Contact (Catalytic) Stage — details & equilibrium\nReaction: 2SO2 + O2 ■ 2SO3 (exothermic).\nKey points:\n- Catalyst: V2O5 speeds up attainment of equilibrium but does NOT change the\nequilibrium constant.\n- Temperature: ~400–450°C (compromise between rate and yield). Lower temperature\nfavours higher equilibrium yield (exothermic), but rate becomes too slow. The\nchosen temperature balances a reasonably fast rate with acceptable yield.\n- Pressure: slight increase would favour formation of fewer moles of gas (SO3), but\nhigh pressures are expensive; industrially near atmospheric pressure is used.\n- Excess oxygen/air is used to push equilibrium toward SO3 formation.\n- Multiple catalyst beds with inter-stage cooling increase conversion (Le Chatelier\n+ faster kinetics).\n\n\n5. Why oleum is used (SO3 handling)\nSO3 reacts violently with water to give a fine mist of sulfuric acid:\nSO3(g) + H2O(l) → H2SO4(aq) (violent, produces fumes/mist)\nTo avoid this, SO3 is absorbed into existing concentrated H2SO4 to give oleum\n(disulfuric acid):\nSO3 + H2SO4 → H2S2O7 (oleum)\nOleum is then carefully diluted with water to yield concentrated H2SO4:\nH2S2O7 + H2O → 2H2SO4This method controls heat release and prevents acid mist formation.\n\n\n6. Industrial considerations & diagrams\nIndustrial plant features:\n- Sulfur/ore burner → SO2 gas\n- Dust collectors and gas washers for purification\n- Drying stage (use concentrated H2SO4)\n- Multi■bed catalytic converter with V2O5 + heat exchangers between beds\n- Absorber tower where SO3 is absorbed into H2SO4 to make oleum\n- Dilution and storage of H2SO4\nKCSE tip: Be able to sketch a simple labelled flow diagram showing stages:\nBurn/roast → Purify/dry → Contact (catalyst) → Absorb (oleum) → Dilute → Store.\n\n\n7. Conditions & role of variables (rate vs yield)\nLe Chatelier's principle & practical compromise:\n- Since the reaction is exothermic, lower temperatures favour higher equilibrium\nyield of SO3, but lower temperature also reduces rate. Industrially ~400–450°C is\nused as a compromise.\n- Higher pressure favours product (fewer moles of gas), but is not\nenergy■efficient; modest pressure used if any.\n- Catalyst increases reaction rate (faster attainment of equilibrium) without\naffecting equilibrium position.\n- Using excess oxygen and removing SO3 (by absorption into H2SO4) shifts\nequilibrium toward products.\n\n\n8. Equations to remember (concise list)\nS(s) + O2(g) → SO2(g)\n4FeS2(s) + 11O2(g) → 2Fe2O3(s) + 8SO2(g) (pyrite roasting)\n2SO2(g) + O2(g) ■ 2SO3(g) (V2O5 catalyst, exothermic)\nSO3(g) + H2SO4(l) → H2S2O7 (oleum)\nH2S2O7 + H2O(l) → 2H2SO4(l)\n\n\n9. Laboratory demonstration (simple contact process model)\nSchool demonstration (small scale): Oxidation of SO2 to SO3 can be shown using\noxidation by oxygen in presence of catalyst (e.g., heated V2O5 powder) producing\ndarker fumes (NOx contaminants may show differently). Safety and scale issues mean\nfull contact process cannot be run in school labs.\nA safer demonstration: show formation of SO2 by burning sulfur (S) and test the gas\nwith acidified potassium dichromate paper (turns from orange to green if SO2\nreduces Cr(VI) to Cr(III)).\n\n\n10. Safety, hazards & environmental issues\nHazards:\n- SO2 and SO3 are toxic, cause respiratory irritation, and contribute to acid rain.\n- H2SO4 is highly corrosive and hygroscopic; handle with care, use PPE.\nEnvironmental control:\n- Scrubbing exhaust gases to remove SO2/NOx reduces air pollution.\n- Proper storage and handling to avoid spills and release of acid fumes.\nKCSE note: When asked about pollution or hazards, mention acid rain, respiratory\nharm, and need for scrubbers/neutralisation of waste gases.\n\n\n11. Common KCSE questions & how to answer\nQ-types you may see:\n- Describe the stages of the contact process and give balanced equations.\n- Explain why V2O5 is used and why low moisture content is needed.- Discuss why oleum is formed instead of directly reacting SO3 with water.\n- Explain effect of changing temperature/pressure on yield (Le Chatelier +\nkinetics).\nAnswering tips:\n- Use equations wherever possible.\n- For conditions, state approximate temperature (~400–450°C) and that catalyst is\nV2O5.\n- Explain trade■off between rate and yield when discussing temperature.\n\n\n12. Short worked example (equilibrium & Le Chatelier)\nIf the temperature of the contact converter is decreased, predict how the\nequilibrium position and rate change.\nAnswer outline:\n- The equilibrium shifts to the right (towards SO3) because reaction is exothermic\n— higher yield of SO3.\n- However, the reaction rate decreases (particles have less kinetic energy), so\noverall conversion per pass may fall unless compensated by using more catalyst or\nlower flow rate.\n- Industrial compromise: choose a moderate temperature to balance rate and yield.\n\n\n13. Summary & KCSE revision checklist\n- Know the sequence: S/ore → SO2 → purified SO2 → SO3 (contact) → oleum → H2SO4.\n- Remember catalyst (V2O5), typical temperature (~400–450°C), and reason for\nforming oleum.\n- Be able to write key equations and draw a simple flow diagram.\n- Be ready to discuss purification, hazards, and effect of changing conditions."
    },
    {
      "id": 4,
      "title": "Organic Compounds & Saturation",
      "content": "Contents: Hydrocarbons, Saturation, Tests, Reactions, Practicals\n\n1. What are Organic Compounds?\nOrganic compounds are chemical compounds primarily containing carbon and hydrogen, often with oxygen, nitrogen, halogens, sulfur, etc. In KCSE you will mostly study hydrocarbons (compounds of C and H) and some functional groups (alcohols, carboxylic acids, esters, halogenoalkanes).\n\n2. Homologous Series & General Features\nA homologous series is a family of compounds with the same functional group and similar chemical properties, differing by CH2 units.\nCommon features:\n- General formula (e.g., alkanes CnH2n+2, alkenes CnH2n, alkynes CnH2n-2).\n- Gradual change in physical properties (boiling point increases with chain length).\n- Same chemical reactions for the series (e.g., alkenes undergo addition).\n- Consecutive members differ by CH2 (14 mass units).\n\n3. Saturated vs Unsaturated Hydrocarbons\nSaturated hydrocarbons (alkanes) contain only single C–C bonds. They are 'saturated' with hydrogen.\nUnsaturated hydrocarbons contain one or more multiple bonds: alkenes (one or more C=C double bonds) and alkynes (C≡C triple bonds).\nSimple formulas:\n- Alkane: CnH2n+2 (e.g., methane CH4, ethane C2H6)\n- Alkene: CnH2n (e.g., ethene C2H4)\n- Alkyne: CnH2n-2 (e.g., ethyne C2H2)\nKCSE tip: Unsaturated compounds decolourise bromine water and acidified KMnO4 (Baeyer's test).\n\n4. Naming (IUPAC basics) — short rules\n1. Find the longest carbon chain — base name (meth-, eth-, prop-, but-, pent-).\n2. Number the chain so that the functional group or double/triple bond gets the lowest possible number.\n3. Name substituents (alkyl groups, halogens) and put numbers in front.\nExamples:\n- CH3CH2CH3 → propane\n- CH2=CH2 → ethene\n- CH3CH=CH2 → prop-1-ene (often written propene)\n\n5. Important Functional Groups (KCSE level)\n1. Alkanes (single bonds) — saturated hydrocarbons.\n2. Alkenes (C=C) — unsaturated, undergo addition reactions.\n3. Alkynes (C≡C) — unsaturated, undergo addition and can be hydrogenated.\n4. Alcohols (–OH) — e.g., ethanol CH3CH2OH. Formed by hydration of alkenes or fermentation/distillation of sugars.\n5. Carboxylic acids (–COOH) — e.g., ethanoic acid CH3COOH. Formed by oxidation of alcohols.\n6. Esters (–COO–) — formed by esterification (alcohol + acid ↔ ester + water); pleasant smells.\n7. Halogenoalkanes — alkane with halogen substituent (e.g., chloroethane).\n\n6. Physical Properties (general patterns)\n- Boiling points increase with chain length due to stronger Van der Waals forces.\n- Branched isomers have lower boiling points than straight-chain isomers.\n- Alkanes are non-polar and insoluble in water but soluble in organic solvents.\n- Alcohols (small ones) are polar and dissolve in water due to hydrogen bonding.\n\n7. Chemical Reactions — Alkanes vs Alkenes\nAlkanes:\n- Combustion: CH4 + 2O2 → CO2 + 2H2O\n- Substitution (UV light): CH4 + Cl2 → CH3Cl + HCl\nAlkenes:\n- Hydrogenation: C2H4 + H2 → C2H6 (Ni catalyst)\n- Halogenation: C2H4 + Br2 → BrCH2CH2Br (decolourises bromine)\n- Hydration: C2H4 + H2O (acid) → C2H5OH (ethanol)\n- Polymerisation: many alkenes (e.g., ethene) join to form polyethene.\nAlkynes behave similarly in addition reactions.\n\n8. Tests for Saturation (Practical)\n1. Bromine Water Test — orange → colourless for unsaturation.\n2. Baeyer's Test (Acidified KMnO4) — purple → brown for unsaturation.\n3. Addition Reactions — demonstrate by hydrogenation and retest with bromine water.\n\n9. Preparation Methods\n1. Alkenes — from cracking hydrocarbons.\n2. Ethanol — fermentation of sugars or hydration of ethene.\n3. Alkanes — from petroleum distillation.\n4. Esters — alcohol + carboxylic acid (acid catalyst).\n\n10. Isomerism\n- Chain, position, and functional group isomerism.\n- Stereoisomerism (cis/trans) for alkenes.\n\n11. Common Reactions\n- Combustion: C3H8 + 5O2 → 3CO2 + 4H2O\n- Addition: CH2=CH2 + Br2 → BrCH2CH2Br\n- Substitution: CH4 + Cl2 → CH3Cl + HCl\n- Esterification: CH3CH2OH + CH3COOH ↔ CH3COOCH2CH3 + H2O\n\n12. Laboratory Practicals\n- Bromine test for unsaturation.\n- Preparation of ethene by dehydration of ethanol.\n- Ester preparation (sweet smell).\n\n13. KCSE Exam Tips\n- State reagent, observation, conclusion in tests.\n- Remember alkenes add, alkanes substitute.\n- Include state symbols and conditions.\n\n14. Short Study Plan\n- Memorise formulas, reactions, and IUPAC naming.\n- Practice drawing isomers and doing past KCSE tests.\n- Revise esterification, combustion, polymerisation."
    },
    {
      "id": 5,
      "title": "Colour Changes in Ions & Their Interactions-Contents: Ion colours, complexes, redox, precipitation, experiments, tips",
      "content": "Colour Changes in Ions & Their Interactions-Contents: Ion colours, complexes, redox, precipitation, experiments, tips\n1. Overview — why ions show colours\nMany ionic solutions (especially transition metal ions and some anions) are\ncoloured because of electronic transitions. For transition metals, partially filled\nd■orbitals allow d−d transitions when light is absorbed; the complementary colour\nis observed. Other causes include charge transfer transitions (ligand-to-metal or\nmetal-to-ligand) and the presence of coloured complexes or precipitates.\n\n\n2. Colour of common ions (useful KCSE list)\nCations (aqueous):\n- Cu2+ : pale blue (aq) → deep blue with excess NH3 (tetraamminecopper(II) complex\n[Cu(NH3)4]2+).\n- Cu+ : often colourless in solution; Cu2O (red solid).\n- Fe2+ : pale green (aq) — oxidises to Fe3+ on standing.\n- Fe3+ : yellow/brown (aq) — often forms brown hydrated oxide (rust-like).\n- Mn2+ : very pale pink (often appears colourless in dilute solutions).\n- Cr3+ : green (aq) — forms dark green complex; Cr2O7^2- orange, CrO4^2- yellow\n(chromate/dichromate are anions).\n- Co2+ : pink (aq) in hydrated form; blue in presence of chloride (tetrahedral\ncomplex [CoCl4]2−).\n- Ni2+ : green (aq) — often green to blue-green.\n- Pb2+ : colourless or white precipitates (e.g., PbSO4 white)\nAnions / Oxoanions:\n- MnO4− (permanganate): deep purple; reduced to Mn2+ (colourless/pale pink) in\nacidic solution.\n- Cr2O7^2− (dichromate): orange; reduces to Cr3+ (green) in presence of reducing\nagents.\n- CrO4^2− (chromate): yellow; equilibrium with dichromate depends on pH.\n- NO2 (nitrogen dioxide): brown gas; NO3− (nitrate) is colourless.\n- I2 (iodine) in organic solvents: purple/blue; in aqueous/iodide forms, brown\nsolution or dark blue with starch)\n\n\n3. Flame tests — characteristic colours\nUseful for identifying some metal ions in qualitative analysis:\n- Lithium (Li+): crimson/red\n- Sodium (Na+): intense yellow (often masks others)\n- Potassium (K+): lilac (use cobalt glass to see when Na present)\n- Calcium (Ca2+): brick red/orange-red\n- Barium (Ba2+): apple green\n- Copper (Cu2+): blue-green\nKCSE tip: use clean nichrome/platinum wire; dip in acid, then in sample; hold in\nBunsen flame. Use cobalt glass to mask sodium's yellow.\n\n\n4. Transition metal complexes & ligand exchange (colour change examples)\nTransition metal ions form coloured complexes that change colour when ligands are\nexchanged.\nExamples:\n- [Cu(H2O)6]2+ (pale blue) + 4NH3 → [Cu(NH3)4(H2O)2]2+ (deep royal blue) —\nobservable deepening of blue with ammonia.\n- [Co(H2O)6]2+ (pink) + 4Cl− (concentrated HCl) → [CoCl4]2− (blue) — pink ↔ blue\nreversible with changing chloride concentration/temperature.\n- [Cr(H2O)6]3+ (green) reacts with excess OH− to give Cr(OH)3 (green/grey\nprecipitate) which dissolves in excess NaOH to form green/blue complex (alkaline\ncomplex).\nExplain: Ligands change the crystal field splitting of d-orbitals resulting in\ndifferent wavelengths absorbed and thus different observed colours.\n\n\n5. Redox colour changes (common examples)\nOxidation and reduction often produce dramatic colour changes — useful in\ntitrations and tests.\nExamples:- MnO4− (purple) → Mn2+ (colourless/pale pink) in acidic medium (used as an\nindicator in KMnO4 titrations).\n- Cr2O7^2− (orange) → Cr3+ (green) when reduced (acidified with reducing agents\nlike SO2 or Fe2+).\n- Fe2+ (pale green) → Fe3+ (yellow/brown) on oxidation by air or oxidising agents.\n- I2 (brown in aqueous solution) + starch → blue-black complex (qualitative test\nfor iodine).\nKCSE note: In redox titrations with KMnO4, the end-point is first persistent pink\ncolour (tiny excess of permanganate that is not reduced).\n\n\n6. Precipitation colour changes (identifying ions)\nMany precipitates have characteristic colours helpful in qualitative analysis:\n- AgCl: white (turns grey/black in sunlight due to decomposition).\n- PbI2: bright yellow (insoluble precipitate when KI added to Pb2+).\n- Cu(OH)2: blue precipitate; on heating dehydrates to black CuO.\n- Fe(OH)2: greenish precipitate that turns brown on standing (oxidises to Fe(OH)3 /\nFe2O3·xH2O).\n- Fe(OH)3: brown precipitate.\n- Al(OH)3: white gelatinous precipitate soluble in excess NaOH (amphoteric).\nKCSE tip: When describing observations, include initial colour, changes on\nstanding, and solubility in excess reagent.\n\n\n7. Colour changes with pH (chromate-dichromate equilibrium & indicators)\nChromate-dichromate equilibrium:\n2CrO4^2− + 2H+ ■ Cr2O7^2− + H2O\n- CrO4^2− (yellow) dominates in alkaline conditions; Cr2O7^2− (orange) dominates in\nacidic conditions. Changing pH shifts the visible colour.\npH indicators and colour: Many indicators change colour over characteristic pH\nranges (e.g., phenolphthalein: colourless in acid → pink in alkaline).\n8. Using colour changes in qualitative analysis schemes\n\n\nQualitative analysis flow:\n1. Observe flame test colour.\n2. Test with dilute HCl and HNO3; add AgNO3 for halide tests (AgCl white, AgBr\ncream, AgI yellow).\n3. Add NaOH or NH3 to produce precipitates; note colours and solubility in excess\nreagent (e.g., Cu(OH)2 blue soluble in NH3).\n4. Add Na2CO3 to test for carbonate (effervescence with acid) and carbonate\nprecipitates.\n5. For cations: systematic addition of reagents to separate into groups (e.g., NH3\nor NH4Cl/NH3 for complexation).\nKCSE advice: Describe colours at each step and use balanced ionic equations where\npossible.\n\n\n9. Practical experiments & demonstrations (safe school-scale)\n1. Colour change on adding NH3 to copper(II) sulfate solution:\n- Procedure: Add aqueous NH3 dropwise to CuSO4(aq). Observation: blue precipitate\nCu(OH)2 forms, then dissolves in excess NH3 to give deep blue [Cu(NH3)4]2+\nsolution.\n- Equations:\nCu2+ + 2OH− → Cu(OH)2(s) (blue precipitate)\nCu(OH)2 + 4NH3 → [Cu(NH3)4(H2O)2]2+ + 2OH− (simplified formation of deep blue\ncomplex)\n2. Reduction of permanganate (KMnO4) with FeSO4 or oxalic acid:\n- Observation: purple KMnO4 decolourises to pale pink/colourless as MnO4− reduces\nto Mn2+.\n- Equation (acidic): 2MnO4− + 10Fe2+ + 16H+ → 2Mn2+ + 5Fe2O3 + 8H2O (complex;\nsimpler: MnO4− → Mn2+).3. Chromate-dichromate colour shift with acid/base:\n- Add acid to yellow chromate solution → orange (dichromate). Add base → yellow.\nSafety: wear goggles and gloves; handle concentrated acids, permanganate, and\nchromium compounds with care (chromium VI is toxic).\n\n\n10. Interpreting mixed colours & masking effects\nIn samples with multiple coloured ions, one intense colour (e.g., Na+ yellow flame)\ncan mask others. Dilution, use of masking agents, or qualitative separation steps\ncan help. Also, colloidal suspensions or precipitates scatter light giving turbid\nor muddy colours—describe clearly.\n\n\n11. Common exam-style observations & how to report them\nWhen asked to report colour changes, always state:\n- Reagent added and its concentration (e.g., excess NH3, dilute HCl)\n- Immediate observation (colour of solution/precipitate)\n- Any subsequent change on standing or on heating\n- Concluding statement: identify ion or probable species present\nExample report: 'Add NaOH to solution: blue precipitate forms which dissolves in\nexcess NH3 to form deep blue solution — indicates Cu2+.'\n\n\n12. Hazards & safe handling\n- Many inorganic reagents are toxic or corrosive: dichromate (Cr2O7^2−) is\ncarcinogenic and highly toxic; permanganate is a strong oxidiser and stains;\nconcentrated acids/bases are corrosive.\n- Work in well-ventilated area; use small quantities; wear PPE (goggles, gloves,\nlab coat).\n- Dispose of heavy-metal waste appropriately; neutralise acids/bases before\ndisposal if safe to do so.\n\n\n13. Short summary & KCSE revision checklist\n- Memorise key colours for common ions (Cu2+, Fe2+/Fe3+, MnO4−, CrO4^2−/Cr2O7^2−,\nCo2+, Ni2+, etc.).\n- Practice describing observations stepwise (reagent → observation → conclusion).\n- Practice simple equations for ligand exchange and redox colour changes.\n- Be careful with spelling of ions and names in answers (e.g., 'permanganate',\n'dichromate')."
    },
    {
      "id": 6,
      "title": "Properties of Metals & Their Oxides",
      "content": "Properties of Metals & Their Oxides  \nContents: Properties of Metals, Chemical Reactions, Metal Oxides, Experiments, Tips  \n\n1. Quick overview  \nMetals: Elements that are generally lustrous, good conductors of heat and electricity, malleable, ductile, dense (usually), and form positive ions (cations) by losing electrons.  \nMetal oxides: Compounds formed when metals react with oxygen. Depending on the metal, oxides are basic, amphoteric, or neutral. (Non-metal oxides are often acidic.)  \n\n2. Physical properties of metals (with short explanations)  \n1. Lustre (shiny surface) — due to free electrons reflecting light.  \n2. Good conductors of heat and electricity — delocalised electrons carry charge and thermal energy.  \n3. Malleability — metal atoms can slide over each other without breaking metallic bonds.  \n4. Ductility — can be drawn into wires for same reason as malleability.  \n5. High density and high melting/boiling points (usually) — strong metallic bonding; exceptions exist (e.g., Na, K).  \n6. Sonorous — metals produce ringing sound when struck.  \n7. Mostly solid at room temperature (except mercury).  \nKCSE tip: When asked for a reason for a property, mention delocalised electrons or metallic bonding.  \n\n3. Chemical properties of metals  \nCommon reactions to know (observations and balanced equations):  \n\n3.1 Reaction with oxygen (combustion)  \n- Magnesium: 2Mg(s) + O2(g) → 2MgO(s) (white powder; bright flame)  \n- Copper (heated): 2Cu(s) + O2(g) → 2CuO(s) (black oxide)  \n- Iron (sparks): 3Fe(s) + 2O2(g) → Fe3O4(s)  \n\n3.2 Reaction with water  \n- Very reactive metals (group 1 & 2):  \n2Na(s) + 2H2O(l) → 2NaOH(aq) + H2(g) (effervescence, floats, may melt)  \nCa(s) + 2H2O(l) → Ca(OH)2(aq) + H2(g)  \n- Less reactive (e.g., Mg): reacts with steam, not cold water: Mg(s) + H2O(g) → MgO(s) + H2(g)  \n- Unreactive metals (Cu, Ag, Au): no reaction with water.  \n\n3.3 Reaction with dilute acids  \nGeneral: Metal + acid → salt + hydrogen gas. Example: Zn + 2HCl → ZnCl2 + H2  \n\n3.4 Displacement reactions  \nA more reactive metal displaces a less reactive metal from its salt solution.  \nExample: Zn + CuSO4 → ZnSO4 + Cu  \n\n3.5 Corrosion and rusting  \nRusting of iron: 4Fe + 3O2 + 6H2O → 4Fe(OH)3 (dehydrates to hydrated iron(III) oxide, rust)  \nPrevention: painting, oiling, galvanising, sacrificial protection (e.g., Mg/Zn).  \n\n4. The Reactivity Series  \nTypical school-level order (most to least reactive): K > Na > Ca > Mg > Al > Zn > Fe > (H) > Cu > Ag > Au  \n- Metals above H react with dilute acids to produce hydrogen gas.  \n- Use the reactivity series to predict displacement reactions.  \n\n5. Extraction of metals (brief summary)  \n- Very reactive metals (K, Na, Ca, Mg, Al): extracted by electrolysis of molten compounds.  \n- Moderately reactive metals (Zn, Fe): often reduced from oxides by carbon (coke) in furnaces.  \n- Least reactive (Cu, Ag, Au): occur native or extracted by heating/chemical methods.  \nKCSE tip: State the extraction method and justify using the metal's reactivity.  \n\n6. Metal oxides — classification & properties  \nTypes: Basic, amphoteric, neutral, acidic (non-metal oxides).  \n\n6.1 Basic oxides  \n- Formed by many metals. React with acids to form salt + water. Example: MgO + 2HCl → MgCl2 + H2O  \n- Some react with water: Na2O + H2O → 2NaOH  \n\n6.2 Amphoteric oxides  \n- React with both acids and bases. Examples: Al2O3, ZnO.  \n- With acid: Al2O3 + 6HCl → 2AlCl3 + 3H2O  \n- With base: Al2O3 + 2NaOH + 3H2O → 2Na[Al(OH)4]  \n\n6.3 Neutral oxides  \n- Do not show acidic or basic behaviour. Examples: CO, N2O.  \n\n6.4 Acidic oxides (non-metal oxides)  \n- Non-metal oxides react with water to give acids or with bases to form salts.  \nExample: CO2 + H2O → H2CO3  \n\n7. Key reactions & equations to remember  \n- Metal + oxygen → metal oxide (e.g., 2Mg + O2 → 2MgO)  \n- Metal + dilute acid → salt + H2 (e.g., Zn + 2HCl → ZnCl2 + H2)  \n- Metal + water (reactive metals) → hydroxide + H2 (e.g., 2Na + 2H2O → 2NaOH + H2)  \n- Metal oxide + acid → salt + water (e.g., MgO + 2HCl → MgCl2 + H2O)  \n- Amphoteric example: Al2O3 + 6HCl → 2AlCl3 + 3H2O and Al2O3 + 2NaOH + 3H2O → 2Na[Al(OH)4]  \n\n8. Laboratory tests & experiments (KCSE-style)  \n8.1 Metal + acid (e.g., Zn + HCl)  \n- Method: Add metal to dilute HCl, warm gently.  \n- Observation: Effervescence; gas tests with lighted splint → 'pop'.  \n- Equation: Zn + 2HCl → ZnCl2 + H2↑  \n\n8.2 Oxide behaviour test  \n- Method: Add oxide to dilute HCl (and separate test with NaOH).  \n- Observation: Basic oxides dissolve in acid; amphoteric dissolve in both.  \n\n8.3 Heating magnesium  \n- Clean ribbon, ignite: intense white flame and white ash (MgO).  \n\n9. How to answer exam questions  \n1. Define and give reason — concise definitions with one-line reasons.  \n2. Write balanced equations — include state symbols when required.  \n3. Classify oxides — test mentally with acid and base.  \n4. Predict displacement — use reactivity series.  \n5. Practical descriptions — give apparatus, observations, equations, safety.  \nMarking hint: Observations and equations often scored separately.  \n\n10. Common mistakes to avoid & study plan  \n- Mistakes: Confusing oxides with hydroxides; forgetting state symbols; wrong displacement direction; calling Al2O3 simply 'basic'.  \nStudy plan:  \n- Memorise the reactivity series.  \n- Practice balanced equations and past KCSE questions.  \n- Revise extraction methods and oxide classifications."
    },
    {
      "id": 7,
      "title": "Periodic Table & Electron Arrangement (Atoms & Ions)-Contents: Table structure, periodic trends, electron configuration,",
      "content": "Periodic Table & Electron Arrangement (Atoms & Ions)-Contents: Table structure, periodic trends, electron configuration, ions, examples\n1. Overview: Why the periodic table matters\nThe periodic table organises elements by increasing atomic number (number of\nprotons) and groups elements with similar chemical properties into columns\n(groups). It helps predict reactivity, electron arrangement, valency, and trends\nlike atomic size and ionisation energy.\n\n\n2. Structure of the periodic table\n- Periods: horizontal rows (1–7). Each period corresponds to the highest principal\nenergy level (n) occupied by electrons in ground state.\n- Groups: vertical columns (1–18; older school numbering uses 1–8 + A/B). Elements\nin the same group have similar valence electron configuration and chemical\nbehaviour.\n- Blocks: s-block (groups 1–2), p-block (groups 13–18), d-block (transition metals,\ngroups 3–12), f-block (lanthanides & actinides).\n\n\n3. Important groups & examples\n- Group 1: Alkali metals (e.g., Na, K) — 1 valence electron, very reactive, form +1\nions, react with water.\n- Group 2: Alkaline earth metals (e.g., Mg, Ca) — 2 valence electrons, form +2\nions, less reactive than group 1.\n- Group 17 (or VII): Halogens (e.g., Cl, Br) — 7 valence electrons, highly reactive\nnon-metals, form -1 ions (halide ions).\n- Group 18: Noble gases (e.g., He, Ne, Ar) — full valence shells, inert, monatomic\ngases.\n- Transition metals: variable oxidation states, d-electron involvement, coloured\ncompounds (e.g., Fe, Cu).\n\n\n4. Periodic trends (simple explanations)\n- Atomic radius: decreases across a period (increased nuclear charge pulls\nelectrons closer) and increases down a group (more shells).\n- Ionisation energy: energy required to remove an electron. Generally increases\nacross a period and decreases down a group.\n- Electron affinity / electronegativity: tendency to gain electrons; generally\nincreases across a period and decreases down a group.\n- Metallic character: decreases across a period and increases down a group.\n\n\n5. Electronic configuration — rules & notation\nBuilding electron configurations follows rules:\n- Aufbau principle: electrons fill lowest energy orbitals first (1s → 2s → 2p → 3s\n→ 3p → 4s → 3d → 4p ...).\n- Pauli exclusion principle: an orbital holds a maximum of 2 electrons with\nopposite spins.\n- Hund's rule: electrons occupy degenerate orbitals singly before pairing, with\nparallel spins.\nNotation examples:\n- Oxygen (8): 1s2 2s2 2p4\n- Sodium (11): 1s2 2s2 2p6 3s1 (or [Ne] 3s1 using noble gas shorthand)\n- Iron (26): 1s2 2s2 2p6 3s2 3p6 4s2 3d6 (simplified) or [Ar] 4s2 3d6.\n\n\n6. Valence electrons & chemical behaviour\nValence electrons are the electrons in the outermost shell and determine bonding\nand reactivity:\n- Group number (main-group elements) indicates valence electrons (e.g., group 1 → 1\nvalence electron; group 17 → 7 valence electrons).\n- Atoms tend to gain, lose, or share electrons to achieve a full valence shell\n(often the noble gas configuration).\n\n\n7. Atoms vs Ions — definitions & examples\n- Atom: neutral particle with equal protons and electrons.\n- Ion: charged particle formed when an atom loses or gains electrons.\nExamples:\n- Sodium atom → Na (11p, 11e): loses 1 electron to form Na+ (11p, 10e) with\nelectron configuration [Ne].\n- Chlorine atom → Cl (17p, 17e): gains 1 electron to form Cl− (17p, 18e) with\nelectron configuration [Ar].\n- Calcium forms Ca2+ by losing two electrons: Ca (20) → Ca2+ (20p, 18e) → [Ar].\n\n\n8. Writing electronic configurations for ions\nWhen forming ions:\n- For main-group elements, remove electrons from the outermost shell.\n- For transition metals, remove s-electrons before d-electrons when forming cations\n(e.g., Fe: [Ar]4s2 3d6 → Fe2+ is [Ar]3d6).\nExamples:\n- Al (13): 1s2 2s2 2p6 3s2 3p1 → Al3+ : 1s2 2s2 2p6 (same as [Ne])\n- S (16): 1s2 2s2 2p6 3s2 3p4 → S2− : add 2 electrons → 3p6 → configuration like\n[Ar].\n\n\n9. Dot & cross diagrams and showing ions\nDot-and-cross diagrams show valence electrons and electron transfer in ionic\nbonding.\nExample: Na + Cl → Na+ + Cl−\n- Na: one dot (•) for valence electron; Cl: seven crosses (×). After transfer, Na+\nhas no valence dot, Cl− has an octet.\nShow charges and resulting ionic compound (NaCl).\n\n\n10. Isoelectronic species\nIsoelectronic species have the same number of electrons and the same electron\nconfiguration.\nExamples: Na+ (10 e−), Ne (10 e−), and Mg2+ (10 e−) are isoelectronic with\nconfiguration 1s2 2s2 2p6.\nIsoelectronic comparison helps predict sizes: among isoelectronic ions, higher\nnuclear charge → smaller radius (Mg2+ < Na+ < Ne neutral atom).\n\n\n11. Common exam examples & step-by-step method\nQ-type: Write electronic configuration of X and X2+ or determine number of\nprotons/electrons.\nMethod:\n1. Identify atomic number (Z) → number of protons and electrons for neutral atom.\n2. For cation: subtract electrons; for anion: add electrons.\n3. Fill orbitals using Aufbau order or write noble-gas shorthand.\nExample: Element with atomic number 17 is Cl: configuration 1s2 2s2 2p6 3s2 3p5.\nCl− is 1s2 2s2 2p6 3s2 3p6 ([Ar]).\n\n\n12. Exceptions & important notes\n- Some transition metals have irregular ground-state configurations (e.g., Cr:\n[Ar]4s1 3d5; Cu: [Ar]4s1 3d10) due to extra stability of half-filled or filled\nd-subshells.\n- When writing ions for transition metals, remember to remove 4s electrons first\nfor cations.\n- Always check total electrons when writing an ion's configuration.\n\n\n13. Practical tips for KCSE answers\n- Use noble-gas shorthand for long configurations.\n- State number of protons, neutrons (if mass number given), and electrons\nseparately when asked.\n- When asked to explain trends, link to nuclear charge and shielding.- For ionic compounds, balance charges to write formula (e.g., Al3+ and O2− →\nAl2O3).\n\n\n14. Short study plan & practice examples\n- Memorise electron capacities for shells/subshells: s(2), p(6), d(10), f(14).\n- Practice 8 examples converting atomic number → electron configuration → ion\nconfiguration.\n- Revise periodic trends: atomic radius, ionisation energy, electronegativity.\n- Do 4 past KCSE questions on electronic configuration and ions (practical and\ntheory).\nKCSE Form 4 — Chemis"
    },
    {
      "id": 8,
      "title": "Reactivity & Activation Energy- Contents: Reactivity, Factors Affecting Rate, Collision Theory, Activation Energy, Catal",
      "content": "Reactivity & Activation Energy- Contents: Reactivity, Factors Affecting Rate, Collision Theory, Activation Energy, Catalysts\n1. What is Reactivity?\nReactivity (chemical reactivity) describes how readily a substance undergoes a chemical change. A highly reactive substance changes quickly and often vigorously (e.g., sodium with water), while a less reactive substance changes slowly or is inert (e.g., gold).\n\n2. Reactivity of Metals (brief recap)\nFor metals, reactivity relates to how easily the metal atom loses electrons to form positive ions (cations). Factors determining metal reactivity include:\n- Atomic size: larger atoms lose electrons more easily (easier to form cations).\n- Ionisation energy: lower ionisation energy → more reactive metal.\n- Shielding effect: more inner electrons reduce nuclear attraction on outer electron → increases reactivity.\n- Electron configuration: metals with a single electron in outer shell (group 1) are highly reactive.\nTypical reactivity series (most → least): K > Na > Ca > Mg > Al > Zn > Fe > (H) > Cu > Ag > Au.\nUse the reactivity series to predict: displacement reactions, whether a metal reacts with water or acid, and extraction methods.\n\n3. Reactivity of Non-metals (brief)\nFor non-metals (like chlorine, oxygen), reactivity often depends on how readily the atom gains electrons (reduction). Factors include electronegativity and electron affinity. For example, fluorine is the most reactive non-metal because it strongly attracts electrons.\n\n4. Factors Affecting Chemical Reactivity (general)\nSeveral experimental factors change how fast reactions happen or whether they proceed at noticeable rates:\n- Temperature: higher temperature increases kinetic energy of particles → more frequent and more energetic collisions → faster reactions.\n- Concentration (or pressure for gases): higher concentration → more particles per volume → more collisions → faster rate.\n- Surface area: when reactants are solids, breaking into smaller pieces increases area available for collisions → faster reaction.\n- Presence of a catalyst: provides an alternative pathway with lower activation energy → speeds up reaction without being consumed.\n- Physical state and mixing: good mixing increases contact between reactants → faster reaction.\n\n5. Collision Theory (simple explanation)\nCollision theory explains reaction rates: for a reaction to occur, reacting particles must:\n1) Collide with each other, and\n2) Collide with sufficient energy (equal to or greater than the activation energy) and with proper orientation.\nOnly collisions that satisfy both conditions lead to successful reactions. Increasing temperature, concentration, or surface area increases the number of 'successful collisions'.\n\n6. Activation Energy (Ea) — definition and meaning\nActivation energy is the minimum energy that reacting particles must have when they collide for a reaction to occur. It is an energy barrier that reactants must overcome to form products. Activation energy is specific to each reaction and determines how easy or difficult it is for the reaction to start.\n\n7. Energy Profile Diagrams (how to read)\nAn energy profile (reaction coordinate diagram) shows potential energy of the system as the reaction proceeds from reactants → transition state → products.\n- Reactants start at a certain energy level.\n- The peak represents the transition state (highest energy) — the difference between reactants and the peak is the activation energy (Ea).\n- Products lie at a higher or lower energy depending on whether the reaction is endothermic (products higher) or exothermic (products lower).\nEndothermic: Ea (forward) large and products higher than reactants. Exothermic: products lower; Ea (forward) still required but net energy released.\n\n8. Catalysts and Activation Energy\nA catalyst speeds up a reaction by lowering the activation energy — it provides an alternative reaction pathway with a lower energy peak. Important points:\n- Catalysts are not consumed in the overall reaction (they may be temporarily changed but are regenerated).\n- Catalysts do not change the position of equilibrium (they speed up both forward and reverse reactions equally) but help reach equilibrium faster.\n- Examples: MnO2 catalyses decomposition of hydrogen peroxide; platinum in catalytic converters; enzymes in biological systems.\n\n9. Experimental Illustrations (KCSE-style practicals)\n9.1 Effect of Surface Area: Marble chips + dilute HCl\n- Procedure: Add equal mass of marble chips (CaCO3) of different sizes to separate test tubes, add same volume and concentration of dilute HCl, measure time for effervescence to finish or volume of CO2 produced.\n- Observation: Smaller chips react faster (more vigorous bubbling) due to larger surface area.\n- Equation: CaCO3(s) + 2HCl(aq) → CaCl2(aq) + H2O(l) + CO2(g).\n\n9.2 Effect of Temperature: Reaction between sodium thiosulfate and HCl\n- Procedure: Mix at different temperatures, observe time for solution to become opaque (sulfur forms).\n- Observation: Higher temperature → faster reaction (shorter time to cloudiness).\n\n9.3 Effect of Catalyst: Decomposition of hydrogen peroxide\n- Procedure: Add H2O2 to test tube; add MnO2 catalyst to another. Compare rate of oxygen evolution.\n- Observation: With MnO2, rapid bubbling (O2) forms. Equation: 2H2O2(aq) → 2H2O(l) + O2(g) (MnO2 catalyst).\n- Safety: H2O2 is an irritant; use gloves and eye protection.\n\n10. Practical Tests & Observations (how to report in KCSE)\nWhen writing practical answers, include:\n- Apparatus used\n- Method (brief steps)\n- Observations (qualitative and quantitative if asked)\n- Balanced chemical equation\n- Conclusion linking result to factor being tested (e.g., 'increased surface area increases reaction rate because more particles are available to collide').\n\n11. Sample short questions & model answers (revision)\nQ1. Define activation energy. — Minimum energy required for reacting particles to undergo a successful collision and form products.\nQ2. State one effect of increasing temperature on reaction rate and explain. — Increases rate because particles gain kinetic energy, increasing both frequency and energy of collisions so more exceed Ea.\nQ3. Give one use of catalysts in industry. — Haber process uses iron catalyst to increase rate of ammonia formation; catalytic converters reduce car exhaust pollutants.\nQ4. Explain why a powdered metal reacts faster than the same mass in a lump. — Powder has larger surface area, more particles exposed to reactant, so more collisions per unit time.\n\n12. KCSE Exam Tips (concise)\n- For practical descriptions, always state the variable you change and the variables you keep constant.\n- Use correct scientific terms: 'activation energy', 'successful collision', 'collision frequency', 'catalyst', 'surface area'.\n- When asked to explain observations, link to collision theory or activation energy.\n- Draw clear energy profile diagrams when required; label Ea, reactants, products, and transition state.\n\n13. Common misconceptions to avoid\n- Catalysts supply energy — false. They only lower the activation energy pathway.\n- Increasing concentration changes equilibrium position significantly for all reactions — only applies depending on reaction stoichiometry; for rates it increases collision frequency.\n- Activation energy equals total energy released — false. Ea is the barrier to start the reaction, not the net energy change.\n\n14. Short study plan\n- Memorise definitions (reactivity, activation energy, catalyst, transition state).\n- Practice drawing and labelling energy profile diagrams.\n- Do at least 5 KCSE past questions on rates and catalysts, and 3 practical descriptions.\n- Revise the reactivity series and link it to displacement and extraction questions."
    }
  ]
}
