{
  "subject": "Physics",
  "code": "physics",
  "topic": "Notes",
  "metadata": {
    "description": "A sample of the most tested physics topics",
    "level": "KCSE",
    "last_updated": "2025-10-07",
    "type": "notes"
  },
  "notes": [
    {
      "id": 1,
      "title": "Waves-Contents: Wave types, properties, reflection, refraction, interference, standing waves, Doppler, experiments",
      "content": "Waves-Contents: Wave types, properties, reflection, refraction, interference, standing waves, Doppler, experiments\n1. Overview\nThis booklet covers waves for KCSE Form 4: types of waves (mechanical & electromagnetic,\ntransverse & longitudinal), key quantities (wavelength, frequency, period, amplitude,\nwave speed), wave equation, reflection, refraction, diffraction, superposition,\ninterference, standing waves, resonance, Doppler effect, sound and light examples,\nexperiments and KCSE tips.\n\n\n2. What is a wave?\nA wave is a disturbance that transfers energy (and information) from one place to\nanother without transferring matter overall. Waves can be mechanical (require a medium,\ne.g., sound, water) or electromagnetic (do not require a medium, e.g., light, radio).\n\n\n3. Wave types\nTransverse waves: particle displacement is perpendicular to direction of wave\npropagation (e.g., waves on a string, electromagnetic waves).\nLongitudinal waves: particle displacement is parallel to direction of propagation (e.g.,\nsound waves in air, compressions and rarefactions).\n\n\n4. Key quantities & definitions\nWavelength (λ): distance between corresponding points on consecutive cycles (m).\nFrequency (f): number of cycles per second (Hz).\nPeriod (T): time for one complete cycle, T = 1/f (s).\nAmplitude (A): maximum displacement from equilibrium (m).\nWave speed (v): speed at which the wave pattern travels (m s■¹).\nPhase: relative position in the cycle (radians or degrees).\n\n\n5. Wave equation & examples\nBasic relation: v = f λ\nExamples:\n- If f = 440 Hz (A4 pitch) and λ in air ≈ v/f (v_sound ≈ 343 m s■¹ at 20°C) → λ ≈ 0.78\nm.\n- For a wave on a stretched string, wave speed v = √(T/µ) where T is tension (N) and µ\nis linear mass density (kg m■¹).\n\n\n6. Reflection of waves\nReflection: wave bounces off boundary. Laws of reflection:\n- Angle of incidence = angle of reflection (measured to the normal)\n- For fixed end (string tied), reflected pulse is inverted (phase change of π).\n- For free end, reflected pulse is upright (no phase change).\nApplications: echoes (sound reflection), optical mirrors.\n\n\n7. Refraction & wave speed change\nRefraction: change in direction of wave when it passes from one medium to another due to\nchange in speed.\nSnell's law for light: n1 sin θ1 = n2 sin θ2 where n = refractive index.\nFor general waves: sin θ1 / sin θ2 = v1 / v2 (since v = f λ and f constant across\nboundary).\n\n\n8. Diffraction\nDiffraction: spreading of waves when they pass through an aperture or around an\nobstacle. More pronounced when aperture size is comparable to wavelength.\nExplains why sound can be heard around corners more easily than high-pitched sounds\n(longer wavelengths diffract more).\n\n\n9. Superposition & interference\nPrinciple of superposition: when two or more waves overlap, resultant displacement is\nalgebraic sum of individual displacements.\nInterference: constructive interference occurs when waves are in phase (amplitudes add);\ndestructive interference when out of phase (amplitudes subtract).\nYoung's double-slit experiment (light): fringe spacing x = λ D / d (D distance to\nscreen, d slit separation) — KCSE-level relation and qualitative description.\n\n\n10. Standing waves & resonance\nStanding waves form when two identical waves travel in opposite directions and\ninterfere. Nodes (zero amplitude) and antinodes (maximum amplitude) form.\nStrings fixed at both ends: allowed wavelengths λ_n = 2 L / n, where n = 1,2,3... (n is\nharmonic number). Frequencies f_n = n v / (2 L).\nOpen-closed tubes (organ pipes) have odd harmonics only: λ_n = 4 L / n (n odd).\nResonance: when driving frequency matches natural frequency, large amplitude\noscillations occur (useful and dangerous).\n\n\n11. Doppler effect\nChange in observed frequency due to relative motion between source and observer.\nFor sound (approx, source or observer moving much slower than speed of sound):\nf' = f (v ± v_o) / (v ■ v_s)\nwhere v is speed of sound, v_o observer speed (positive if moving toward source), v_s\nsource speed (positive if moving toward observer). Signs must be used carefully.\nQualitative: approaching source → frequency increases (pitch higher); receding →\nfrequency decreases (pitch lower).\n\n\n12. Sound waves — properties & examples\nSound in air is longitudinal. Speed depends on medium and temperature (approx v ≈ 331 +\n0.6 T°C m s■¹).\nPitch relates to frequency; loudness relates to amplitude (intensity proportional to\namplitude squared).\nApplications: echoes, SONAR, musical instruments (standing waves in strings and pipes).\n\n\n13. Electromagnetic waves — key points\nEM waves are transverse, travel at speed c in vacuum (c ≈ 3.00×10^8 m s■¹). They include\nradio, microwaves, infrared, visible, ultraviolet, X-rays, gamma rays.\nIn vacuum v = f λ = c. In media, speed reduces and wavelength shortens (frequency\nunchanged).\nEM waves do not require a medium and are used in communication, imaging, and heating\n(microwaves).\n\n\n14. Energy transported by waves\nEnergy carried by a wave is proportional to square of amplitude (E ∝ A^2) and depends on\nfrequency and medium.\nFor a progressive wave on a string, average power transmitted P ∝ A^2 ω^2 (details\nbeyond KCSE but useful qualitatively).\n\n\n15. Wave experiments (KCSE practicals)\n1) Ripple tank: demonstrate reflection, refraction, diffraction, interference; measure\nwavelength using strobe or scale.\n2) Slinky or spring: show longitudinal pulses and measure wave speed; measure v =\ndistance / time for pulse.\n3) String standing waves: set up string over pulley with weight, vary frequency or\nlength to find harmonics and compute wave speed using f_n = n v / (2 L).\n4) Measure speed of sound: echo method (v = 2d / t) or resonance in tube (find lengths\nfor resonance at given frequency).\n\n\n16. Practical tips & graph interpretation\nOn displacement-time and displacement-distance graphs:\n- For a fixed position, displacement-time graph shows oscillation with period T (time-\ndomain).\n- For an instant in time, displacement-distance graph shows spatial waveform with\nwavelength λ.\nWhen sketching standing waves mark nodes and antinodes. For interference, identify\nconstructive/destructive regions.\n\n\n17. Sample KCSE-style questions & short answers\nQ1: A wave has frequency 50 Hz and wavelength 0.6 m. Find wave speed.\n- v = f λ = 50 × 0.6 = 30 m s^-1.\nQ2: String length 1.2 m fixed at both ends; wave speed 48 m s^-1. Find lowest frequency\n(fundamental).\n- f1 = v / (2 L) = 48 / (2 × 1.2) = 48 / 2.4 = 20 Hz.\nQ3: Observed frequency from ambulance siren drops as it passes; explain qualitatively\nusing Doppler effect.\n\n\n18. Common misconceptions & KCSE tips\n- Frequency of wave does not change when entering new medium (f constant), wavelength\nand speed change.\n- Centripetal vs 'centrifugal' are different contexts — for waves avoid mixing\nmechanical forces vocabulary.\n- For standing waves, nodes are points of zero amplitude (not moving). Antinodes have\nmaximum amplitude.\n- Always state whether given speed is in air or other medium; mention temperature if\nnecessary for sound speed.\n\n\n19. Quick formula sheet & summary\nKey relations:\n-v=fλ\n- T = 1/f\n- For string harmonics: f_n = n v / (2 L)\n- For open-closed pipe fundamentals: f_n = n v / (4 L) for n = 1,3,5...\n- Doppler (approx): f' = f (v ± v_o)/(v ■ v_s)\nKCSE checklist: be able to define wave terms, apply v = f λ, sketch and label standing\nwaves, describe key experiments and explain Doppler qualitatively.\n\n\n20. Revision plan & practice\n- Memorise definitions and v = f λ.\n- Practice 6 past KCSE waves questions covering reflection/refraction, standing waves,\npipe/strings harmonics and Doppler.\n- Do ripple tank and string practical write-ups if possible; sketch and label results.\n- Review relationship between frequency, period and wavelength; convert units where\nneeded."
    },
    {
      "id": 2,
      "title": "The Electromagnetic Spectrum-Contents: Spectrum order, ranges, properties, uses, hazards, calculations, KCSE tips",
      "content": "The Electromagnetic Spectrum-Contents: Spectrum order, ranges, properties, uses, hazards, calculations, KCSE tips\n1. Overview\nThe electromagnetic (EM) spectrum is the range of all types of electromagnetic\nradiation. EM waves are transverse waves made of oscillating electric and magnetic\nfields and travel at the speed of light in vacuum (c ≈ 3.00×10^8 m s■¹). They transfer\nenergy and momentum without requiring a medium.\n\n\n2. Basic relations & constants\nKey equations:\n- Wave relation: v = f λ (for EM in vacuum v = c ≈ 3.00×10^8 m s■¹)\n- Photon energy: E = h f (Planck's constant h = 6.63×10^−34 J s)\n- Alternative: E = (h c) / λ\nUseful constants:\n- Speed of light c ≈ 3.00×10^8 m s■¹\n- Planck constant h ≈ 6.63×10^−34 J s\n- Typical photon energies given by E (in eV): 1 eV ≈ 1.60×10^−19 J.\n\n\n3. Order of the spectrum (low to high frequency)\nRadio → Microwaves → Infrared (IR) → Visible light → Ultraviolet (UV) → X■rays → Gamma\nrays.\nAlternatively, order by wavelength (longest → shortest) is the reverse: radio (longest\nλ) to gamma (shortest λ).\nVisible light is only a tiny part (roughly 400–700 nm) but important for many\nobservations.\n\n\n4. Typical wavelength/frequency ranges (approximate school-level values)\nRadio: λ > 1 m (f < 3×10^8 Hz) — includes AM/FM and TV bands.\nMicrowaves: ~1 m to 1 mm (f ≈ 3×10^8 to 3×10^11 Hz).\nInfrared (IR): ~1 mm to 700 nm (f ≈ 3×10^11 to 4.3×10^14 Hz).\nVisible: ~700 nm (red) to ~400 nm (violet) (f ≈ 4.3×10^14 to 7.5×10^14 Hz).\nUltraviolet (UV): ~400 nm to 10 nm (f ≈ 7.5×10^14 to 3×10^16 Hz).\nX■rays: ~10 nm to 0.01 nm (f ≈ 3×10^16 to 3×10^19 Hz).\nGamma rays: λ < 0.01 nm (f > 3×10^19 Hz).\n\n\n5. Visible spectrum & colours\nApproximate wavelengths for colours:\n- Red ≈ 700 nm\n- Orange ≈ 620 nm\n- Yellow ≈ 580 nm\n- Green ≈ 530 nm\n- Blue ≈ 470 nm\n- Violet ≈ 400 nm\nWhite light is a mixture of all visible colours; dispersion (e.g., prism) separates them\nbecause refractive index varies with wavelength.\n\n\n6. Properties & general behaviour across spectrum\n- All EM waves travel at same speed c in vacuum.\n- Higher frequency (shorter wavelength) → higher photon energy (E = hf) → more\npenetrating and more likely to be ionizing.\n- Interaction with matter depends on wavelength: long waves diffract and penetrate\ndifferently from short waves which are absorbed or scattered.\n- Visible & IR often involve electronic/vibrational transitions; UV, X-rays, gamma can\nionize atoms/molecules.\n\n\n7. Radio waves — uses & features\nUses: communication (AM/FM radio, TV, two-way radio), radar, long-distance broadcasting.\nFeatures: long wavelengths bend around obstacles, reflect from the ionosphere (certain\nbands), low photon energy (non-ionizing).\nSafety: generally safe at typical exposure levels; strong RF can heat tissue (microwave\neffect).\n\n\n8. Microwaves & radar\nUses: microwave ovens (dielectric heating of water molecules), radar, satellite\ncommunication, Wi-Fi, mobile phone links (some bands).\nMicrowaves are absorbed by polar molecules causing heating; require careful shielding in\nappliances (metal boxes).\n\n\n9. Infrared (IR)\nIR radiation associated with thermal energy (heat). Hotter objects emit more IR (black-\nbody radiation).\nUses: thermal imaging, remote controls, fibre-optic communication (near-IR), IR heaters.\nIR is non-ionizing but can cause burns at high intensity.\n\n\n10. Ultraviolet (UV)\nUV divided into UVA, UVB, UVC (approx):\n- UVA (320–400 nm): least energetic, penetrates skin, causes tanning and ageing.\n- UVB (280–320 nm): more energetic, causes sunburn and DNA damage (can lead to skin\ncancer).\n- UVC (100–280 nm): most energetic UV, strongly absorbed by atmosphere and germicidal.\nUses: sterilization (UVC), fluorescent lamps, detection, photochemical reactions.\nHazards: skin erythema, eye damage (photokeratitis), DNA damage.\n\n\n11. X-rays\nGenerated by accelerating electrons hitting metal targets (bremsstrahlung &\ncharacteristic X-rays).\nUses: medical imaging (radiography), security scanners, crystallography (X-ray\ndiffraction).\nX-rays are ionizing — can damage tissue and cause cancer; use minimal exposure and\nshielding (lead aprons).\n\n\n12. Gamma rays\nProduced by nuclear transitions, radioactive decay and some astronomical processes.\nVery high energy and highly penetrating; used in sterilization, cancer radiotherapy\n(targeted), and astrophysics observations.\nExtreme hazard due to ionizing nature; strict shielding and safety protocols required.\n\n\n13. Ionizing vs non-ionizing radiation\nNon-ionizing: radio, microwaves, IR, visible (generally). They do not have enough photon\nenergy to remove tightly bound electrons.\nIonizing: UV (short wavelength), X-rays, gamma rays — can ionize atoms/molecules, cause\nchemical changes and biological damage.\nKCSE tip: remember 'ionizing' begins at high-energy end (UV and beyond).\n\n\n14. Atmospheric absorption & windows\nThe atmosphere absorbs many wavelengths: ozone layer absorbs much UV (protecting life),\nwater vapour and CO2 absorb certain IR bands, atmosphere transparent to visible and some\nradio windows (hence why optical astronomy and radio astronomy use those bands).\nRemote sensing uses atmospheric windows to observe Earth's surface from satellites.\n\n\n15. Detection & measurement\nDetectors vary: radio antennas, microwave receivers, photodiodes and CCDs for\nvisible/IR, photographic film and semiconductor detectors for X-rays, Geiger counters\nand scintillation detectors for gamma rays.\nSpectrometers and diffraction gratings separate wavelengths for analysis.\n\n\n16. Applications across fields (summary)\n- Communication: radio, microwave, optical fibre (IR/visible lasers)\n- Medicine: X-rays (imaging), gamma (radiotherapy), IR thermography\n- Industry: microwave heating, lasers (cutting, welding), UV curing\n- Science & astronomy: radio telescopes, optical telescopes, X-ray/gamma observatories\n- Everyday: visible light (vision), remote controls (IR), Wi-Fi (microwaves)\n\n\n17. Safety & protective measures\n- Limit exposure to ionizing radiation; use shielding, time, and distance.\n- UV protection: sunscreen, protective clothing, limit direct exposure.\n- Microwaves: avoid leakage from ovens; follow manufacturer guidelines.\n- X-rays/gamma: use lead shielding and strict procedural controls; monitor doses with\ndosimeters.\n\n\n18. Simple calculations & examples\n1) Wavelength of green light (f = 5.5×10^14 Hz): λ = c / f = 3.00×10^8 / 5.5×10^14 ≈\n5.45×10^−7 m ≈ 545 nm.\n2) Photon energy of 500 nm light: E = hc/λ = (6.63×10^−34 × 3.00×10^8) / (5.00×10^−7) ≈\n3.98×10^−19 J ≈ 2.49 eV.\n3) Radio wave frequency 100 MHz (FM): find wavelength: λ = c / f ≈ 3.00×10^8 / 1×10^8 =\n3.0 m.\n\n\n19. Typical KCSE questions & how to answer\n- Define EM wave and state v = f λ.\n- Give order of spectrum and identify regions for given wavelengths/frequencies.\n- Calculate wavelength/frequency/energy using v = f λ and E = h f.\n- Discuss uses/risks of a given part of spectrum (e.g., UV hazards).\n- Explain atmospheric absorption and why some telescopes are space-based (e.g., X-ray\nastronomy requires orbiting telescopes).\n\n\n20. Quick revision checklist & tips\n- Memorise order of spectrum and approximate visible range (400–700 nm).\n- Know v = f λ and E = h f and be able to convert units (m ↔ nm, J ↔ eV).\n- Be ready to list uses and hazards for each region and explain why higher frequency\nmeans more energetic/penetrating.\n- Practice 6 problems converting between frequency, wavelength and photon energy."
    },
    {
      "id": 3,
      "title": "Work, Energy, Power & Machines-Contents: Work, Energy, Power, Simple Machines, Examples, Practicals",
      "content": "Work, Energy, Power & Machines-Contents: Work, Energy, Power, Simple Machines, Examples, Practicals\n1. Overview\nThis booklet covers the key concepts of work, energy, power and simple machines for KCSE\nForm 4. Includes definitions, formulas, units, energy forms, conservation of energy,\nwork-energy theorem, power calculations, simple machines (lever, pulley, inclined plane,\nwheel & axle, gears), mechanical advantage, velocity ratio, efficiency, worked examples,\nexperiments and exam tips.\n\n\n2. Work — definition & formula\nWork done by a constant force F acting through displacement s at angle θ to the\ndisplacement:\nW = F s cosθ (joules, J).\nIf force is parallel to displacement, W = F s. If force is perpendicular (θ = 90°), W =\n0.\nFor variable force, W = ∫ F ⋅ ds (calculus form).\n\n\n3. Energy — forms & units\nEnergy is the capacity to do work. SI unit: joule (J).\nCommon forms:\n- Kinetic energy (KE): energy of motion, KE = 1/2 m v^2.\n- Gravitational potential energy (GPE): energy due to position near Earth's surface, PE\n= m g h.\n- Elastic potential energy (spring): for Hooke's law region, E = 1/2 k x^2 (k spring\nconstant, x extension).\n- Chemical, thermal, electrical, nuclear, radiant (light) etc.\nEnergy can be transformed between forms (e.g., GPE → KE in free-fall).\n\n\n4. Work-Energy Theorem & Conservation of Energy\nWork-energy theorem: Net work done on an object = change in its kinetic energy: W_net =\n∆(1/2 m v^2).\nConservation of energy (isolated system): Total energy remains constant — energy may\nchange form but cannot be created or destroyed.\nExample: A mass dropped from height h: potential energy m g h converts to kinetic energy\n1/2 m v^2 (neglecting air resistance).\n\n\n5. Power — definition & formulas\nPower (P) is the rate at which work is done or energy is transferred. Unit: watt (W)\nwhere 1 W = 1 J s^-1.\nFormulas:\n- P = W/t\n- P = F v (if force acts and object moves with velocity v in direction of force)\n- P = V I (electrical power)\n- Also P = ∆E / t where ∆E is energy change.\nKilowatt (kW) often used for appliances; 1 kW = 1000 W. kWh used for energy consumed: 1\nkWh = 3.6×10^6 J.\n\n\n6. Efficiency & losses\nEfficiency (η) = (useful energy output / total energy input) × 100% = (useful power\noutput / total power input) × 100%.\nη = (work output / work input) × 100%.\nReal machines have <100% efficiency due to friction, air resistance, inelastic\ndeformations, heat losses, sound.\nExample: If input power 200 W and useful output 150 W → efficiency = (150/200)×100% =\n75%.\n\n\n7. Simple machines — purpose & key terms\nSimple machines make work easier by changing the magnitude or direction of a force. Key\nterms:\n- Effort (E): input force\n- Load or resistance (W or R): output force to be overcome\n- Distance moved by effort (d_e) and by load (d_l)\n- Mechanical Advantage (MA) = Load / Effort = R / E (how much force is amplified)- Velocity Ratio (VR) = distance moved by effort / distance moved by load = d_e / d_l\n- Efficiency η = (MA / VR) × 100% (since MA ≤ VR for real machines)\n\n\n8. Lever (classes & formulas)\nLever: rigid bar pivoted at fulcrum.\nMoments (torque): moment = force × perpendicular distance from pivot (N m).\nFor equilibrium: E × d_e = R × d_l → MA = R/E = d_e/d_l = VR (ideal, no losses).\nClasses:\n- First-class: fulcrum between effort and load (e.g., seesaw)\n- Second-class: load between fulcrum and effort (e.g., wheelbarrow)\n- Third-class: effort between fulcrum and load (e.g., human arm)\nKCSE tip: use moments to solve lever problems; ensure perpendicular distances used.\n\n\n9. Inclined plane (ramp)\nAn inclined plane reduces effort needed to raise a weight by increasing distance moved.\nIdeal mechanical advantage (no friction): MA = load / effort = length of slope /\nvertical height = L / h = VR.\nWith friction, effort must overcome component of weight parallel to plane: E = W sinθ +\nfriction.\nWork input ≈ work output + losses; for ideal wedge E × d_e = W × h.\n\n\n10. Pulley systems\nSingle fixed pulley: changes direction of effort, MA = 1.\nSingle movable pulley: MA = 2 (effort halved ideal).\nBlock and tackle (combination): MA = number of supporting rope segments attached to load\n(ideal).\nVR = distance effort moves / distance load moves; MA = load/effort; Efficiency =\n(MA/VR)×100%.\n\n\n11. Wheel and axle & gears\nWheel and axle: two disks of radii R_wheel and R_axle connected; MA (ideal) = R_wheel /\nR_axle = torque amplification.\nGears: transmit torque and change rotational speed. Gear ratio = N_output / N_input =\nω_input / ω_output inversely.\nPower transmitted ideally conserved: τ_in ω_in = τ_out ω_out (neglecting losses).\n\n\n12. Springs & elastic potential energy\nHooke's law (within elastic limit): F = k x (k spring constant, N m^-1, x extension).\nElastic potential energy stored: E = 1/2 k x^2 (from integrating F dx).\nWork done stretching spring from 0 to x equals 1/2 k x^2.\n\n\n13. Worked numerical examples\n1) Work done lifting 10 kg box by 2.5 m vertically. (g=9.8)\n- W = m g h = 10 × 9.8 × 2.5 = 245 J.\n2) A 50 kg mass falls 8.0 m. Find speed on impact ignoring air resistance.\n- m g h = 1/2 m v^2 → v = √(2 g h) = √(2 × 9.8 × 8) ≈ √(156.8) ≈ 12.52 m s^-1.\n3) A pulley system ideal MA = 4 lifts 200 N load. Find effort.\n- E = R / MA = 200 / 4 = 50 N. If rope moved 2 m, load moves 0.5 m (VR=4).\n4) Power: A motor does 3600 J in 30 s. P = W/t = 3600/30 = 120 W.\n\n\n14. Energy transfer & conservation examples\nRoller coaster type example: top of hill height H; at bottom, neglecting friction,\npotential energy m g H converts to kinetic energy 1/2 m v^2 → v = √(2 g H).\nIf friction does work W_loss, mechanical energy conserved as m g H = 1/2 m v^2 + W_loss.\n\n\n15. Experiments & practicals (KCSE style)\n1) Verify work done lifting weights: measure force and vertical displacement; compare\nmeasured work to m g h.\n2) Determine spring constant: hang masses, measure extension, plot F vs x, slope = k.\n3) Measure efficiency of pulley system: input work (force × distance) vs output work\n(load × lift height), compute η.\n- Include apparatus, method, observations, calculations, sources of error and\nimprovements.\n\n\n16. Common exam questions & how to answer\n- Define work, energy, power — include formula and units.\n- Use conservation or work-energy theorem to connect forces and motion.\n- For machines, show calculations of MA, VR, and efficiency, and explain losses.\n- Include clear diagrams and label distances (effort path and load path).\n\n\n17. Typical mistakes to avoid\n- Confusing work and power (work is energy, power is rate).\n- Forgetting cosθ in W = F s cosθ when force not parallel.\n- Using mass instead of weight (force) in work calculations: use weight W = m g when\nlifting vertically.\n- Mixing up MA and VR; remember MA ≤ VR for real machines.\n\n\n18. Quick reference formulas\nW = F s cosθ\nKE = 1/2 m v^2\nPE = m g h\nSpring E = 1/2 k x^2\nP = W/t = F v\nMA = Load / Effort\nVR = distance effort / distance load\nη = (MA/VR) × 100% = (useful energy output / total energy input) × 100%\n\n\n19. Revision checklist & tips\n- Memorise key formulas and units.\n- Practice converting between J, kJ and kWh where needed.\n- Draw diagrams for machine problems labeling effort and load distances.\n- Do 6–8 past KCSE questions on energy, power and efficiency; do 3 practical write-ups."
    },
    {
      "id": 4,
      "title": "Pressure & Circular Motion-Contents: Pressure in fluids, buoyancy, Pascal's law, uniform circular motion, centripetal fo",
      "content": "Pressure & Circular Motion-Contents: Pressure in fluids, buoyancy, Pascal's law, uniform circular motion, centripetal force, examples\n1. Overview\nThis booklet covers Pressure (in solids, liquids and gases), hydrostatic pressure,\nPascal's principle, buoyancy and Archimedes' principle; and Circular Motion (uniform\ncircular motion, centripetal force and acceleration, angular speed, examples such as\nvertical circle and conical pendulum). Includes key formulas, worked examples,\nexperiments and KCSE tips.\n\n\n2. Pressure — definition & units\nPressure (P) is the force acting per unit area. Formula:\nP=F/A\nUnits: pascal (Pa) where 1 Pa = 1 N m^-2. Also kPa (10^3 Pa), MPa (10^6 Pa).\nPressure is a scalar quantity (has magnitude only).\n\n\n3. Pressure in solids & contact pressure\nContact pressure depends on how force is distributed. For same force, smaller area →\nlarger pressure (e.g., knife edge, heels vs flat shoe).\nApplications: sharp tools reduce area to increase pressure; snowshoes increase area to\nreduce pressure on snow.\n\n\n4. Pressure in liquids — hydrostatic pressure\nIn a fluid at rest, pressure increases with depth due to weight of overlying fluid.\nFormula:\nP = P0 + ρ g h\nwhere P is pressure at depth h, P0 is pressure at surface (often atmospheric), ρ is\nfluid density (kg m^-3), g is gravitational acceleration (~9.8 m s^-2), h is depth (m).\nGauge pressure (above atmospheric) often used: p_g = ρ g h.\nKey point: pressure at same depth in same fluid is the same regardless of shape or\nvolume of container.\n\n\n5. Pascal's Principle & hydraulic systems\nPascal's principle: A change in pressure applied to an enclosed incompressible fluid is\ntransmitted undiminished to every part of the fluid and the walls of the container.\nHydraulic press: two pistons with areas A1 (effort) and A2 (load). With pressure\ntransmitted:\nF1/A1 = F2/A2 → F2 = F1 × (A2/A1)\nMechanical advantage (ideal) = A2/A1 = F2/F1. Useful for car brakes, hydraulic jacks.\nWork and distance: displacement of larger piston is smaller (conservation of energy).\n\n\n6. Atmospheric pressure & barometer\nAtmospheric pressure is the pressure due to the weight of the air above. At sea level ≈\n101.3 kPa (standard atmospheric pressure).\nMercury barometer: column of mercury balances atmospheric pressure: P_atm = ρ_Hg g h (h\n~ 760 mm at sea level). Units often reported in mmHg (torr).\n\n\n7. Manometer & pressure measurement\nU-tube manometer measures pressure difference between a gas and atmosphere or between\ntwo gases using height difference of liquid columns.\nIf one limb connected to gas at pressure P and other open to atmosphere P_atm,\ndifference ∆h relates by ∆P = ρ g ∆h (taking densities into account if different\nliquids).\n\n\n8. Buoyancy & Archimedes' principle\nArchimedes' principle: A body wholly or partly immersed in a fluid experiences an\nupthrust (buoyant force) equal to the weight of fluid displaced.\nUpthrust U = ρ_fluid × V_displaced × g.\nIf U > weight → object rises; U < weight → sinks; U = weight → floats.\nApparent weight when submerged = actual weight − upthrust.\nRelative density (density ratio) used to determine floatation: density_object /\ndensity_fluid.\n\n\n9. Worked example — hydrostatic pressure & buoyancy\nExample 1: Water of density 1000 kg m^-3; find pressure 5.0 m below surface (take\natmospheric negligible if asked gauge):\np = ρ g h = 1000 × 9.8 × 5.0 = 49,000 Pa = 49 kPa.\nExample 2: A block of volume 0.02 m^3 floats displacing 0.015 m^3 of water. Find\nupthrust and whether it will float if weight is 150 N.\nUpthrust = ρ g V = 1000 × 9.8 × 0.015 = 147 N. Since upthrust (147 N) < weight (150 N)\n→ block sinks further until displaced volume gives equal upthrust.\n\n\n10. Experiments & practicals (KCSE style) — pressure & buoyancy\n1) Measure pressure at different depths: use pressure sensor or U-tube manometer; verify\nlinear relation p = ρ g h.\n2) Hydraulic press demo: apply small force on small piston and measure large force on\nbig piston; show F2/F1 = A2/A1.\n3) Determine density of liquid by measuring mass and volume or using sinking/floating\nmethod and Archimedes principle.\nInclude apparatus, method, observations, calculations, precautions and sources of error.\n\n\n11. KCSE tips on pressure questions\n- Clearly state whether pressure required is absolute (including atmospheric) or gauge\n(above atmosphere).\n- Show substitution with correct units (ρ in kg m^-3, g in m s^-2, h in m).\n- For hydraulic machines mention energy/work tradeoffs: F × d small piston = F' × d'\nlarge piston (neglecting losses).\n\n\n12. Transition to Circular Motion — connections\nCircular motion problems sometimes involve centripetal forces that can be provided by\ntension, friction, normal reaction, or component of weight — combine pressure/fluid\nproblems with circular motion where relevant (e.g., water in rotating bucket creates\nparabolic surface, centrifuge principles).\n\n\n13. Uniform Circular Motion — basic definitions\nAn object undergoing uniform circular motion moves in a circle at constant speed v.\nAlthough speed is constant, velocity changes direction, so acceleration exists\n(centripetal acceleration).\nRadius r, period T (time for one revolution), frequency f (revolutions per second),\nangular speed ω (radians per second) relate by:\n- v = 2π r / T = ω r\n-f=1/T\n- ω = 2π f = 2π / T\n\n\n14. Centripetal acceleration & force\nCentripetal acceleration a_c = v^2 / r = ω^2 r (directed towards centre).\nCentripetal force required: F_c = m a_c = m v^2 / r = m ω^2 r.\nThis force is not a new type of force but the net force towards centre provided by\ntension, friction, normal reaction, gravity component etc.\n\n\n15. Examples of forces providing centripetal force\n- Tension in string for an object on a string.\n- Friction between tyres and road for car rounding a bend.\n- Normal reaction on banked curve for car (with components providing centripetal\nforce).\n- Gravity provides centripetal force for satellites in orbit (weight provides necessary\ncentripetal acceleration).\n\n\n16. Banked curves (no friction) — design speed\nOn a banked curve of angle θ and radius r, for no friction, component of normal reaction\nprovides centripetal acceleration:\ntan θ = v^2 / (r g) → design speed v = √(r g tan θ).\nInclude derivation: resolve forces horizontally and vertically; set vertical net = 0,\nhorizontal net = m v^2 / r.\n\n\n17. Conical pendulum\nMass m on string length L rotates making cone with vertical. For small angles,\nhorizontal component of tension provides centripetal force.\nRelations (exact): T cosθ = m g (vertical equilibrium); T sinθ = m v^2 / r (horizontal\ncentripetal). With r = L sinθ.\nFrom these, v^2 = g r tanθ / cosθ etc. For small θ approximations simplify relations.\n\n\n18. Vertical circular motion & critical speed\nFor mass on string in vertical circle (radius r), tension varies with position.\nAt top: minimum speed to keep string taut: m v_top^2 / r ≥ m g → v_top^2 ≥ g r.\nEnergy conservation between bottom and top: 1/2 m v_bottom^2 − 1/2 m v_top^2 = m g (2 r)\n(difference in potential). Combine to find required launch speed.\nAt bottom, tension is larger due to centripetal requirement plus weight: T_bottom = m\nv_bottom^2 / r + m g.\n\n\n19. Experimental investigations (circular motion)\n1) String & bob on rotating platform: measure period and radius, compute v and\ncentripetal force; verify F ∝ v^2/r.\n2) Whirling bung on string and recording break force to find F_c and check\nproportionality with v^2.\n3) Conical pendulum: measure period vs length and angle to verify relationships.\nRecord apparatus, procedure, measurements, graphs (F vs v^2 or v^2 vs r), and discuss\nsources of error (air resistance, non-uniform motion).\n\n\n20. Worked examples — circular motion\nExample 1: A 0.2 kg stone is whirled in a horizontal circle of radius 0.5 m at speed 6 m\ns^-1. Find centripetal force.\na_c = v^2/r = 36 / 0.5 = 72 m s^-2. F = m a = 0.2 × 72 = 14.4 N.\nExample 2: Car rounding flat curve radius 50 m at 20 m s^-1. Find required frictional\nforce (centripetal).\na_c = v^2/r = 400 / 50 = 8 m s^-2. For mass 1000 kg, F = 1000 × 8 = 8000 N.\nExample 3: A road is banked at 15° with radius 30 m. Find speed at which no friction is\nneeded: v = √(r g tanθ).\ntan15° ≈ 0.268; v = √(30 × 9.8 × 0.268) ≈ √(78.9) ≈ 8.88 m s^-1.\n\n\n21. Relationships summary & formula sheet\nPressure:\n-P=F/A\n- p = ρ g h (gauge pressure)\n- Pascal's principle: F1/A1 = F2/A2\n- Upthrust: U = ρ V g\nCircular motion:\n- v = ω r = 2π r / T\n- a_c = v^2 / r = ω^2 r\n- F_c = m v^2 / r = m ω^2 r\n- Banked curve (no friction): tan θ = v^2/(r g)\n\n\n22. KCSE tips & common mistakes\n- For pressure questions, state whether atmospheric pressure included; use correct\ndensities and units.\n- For buoyancy, remember upthrust equals weight of displaced fluid.- In circular motion, remember centripetal force points to centre — don't call it\ncentrifugal (that's apparent in rotating frame).\n- Use energy methods for vertical circle problems where appropriate; include\ngravitational potential differences.\n- Show working: label forces, choose axes, and check units.\n\n\n23. Quick revision checklist\n- Memorise p = ρ g h, P = F/A and upthrust formula.\n- Practice 5 hydrostatic pressure and buoyancy problems and 6 circular motion problems\n(centripetal force, banked curve, vertical circle).\n- Be comfortable sketching free-body diagrams for circular motion (tension, weight,\nnormal) and for buoyant bodies."
    },
    {
      "id": 5,
      "title": "Mechanics: Linear Motion & Newton's Laws-Contents: Kinematics, Newton's laws, forces, momentum, energy, worked examples",
      "content": "Mechanics: Linear Motion & Newton's Laws-Contents: Kinematics, Newton's laws, forces, momentum, energy, worked examples\n1. Overview\nThis booklet covers linear (one-dimensional) motion and Newton's laws of motion for KCSE\nForm 4. Includes kinematics (displacement, velocity, acceleration), SUVAT equations for\nconstant acceleration, graphs, free-fall, projectiles (one-dimensional components),\nNewton's three laws, forces (normal, weight, friction, tension), free-body diagrams,\nfriction, momentum and impulse, and worked examples.\n\n\n2. Key quantities & units\nDisplacement (s) — measured in metres (m); vector.\nDistance — scalar (total length travelled).\nVelocity (v) — rate of change of displacement: v = ds/dt (m s■¹); can be average v_avg =\n∆s/∆t.\nSpeed — magnitude of velocity (m s■¹).\nAcceleration (a) — rate of change of velocity: a = dv/dt (m s■²).\nTime (t) — seconds (s).\n\n\n3. Kinematics — constant acceleration (SUVAT)\nFor motion with constant acceleration, the five important quantities are s\n(displacement), u (initial velocity), v (final velocity), a (acceleration), t (time).\nKey equations (SUVAT):\n-v=u+at\n- s = u t + 0.5 a t^2\n- v^2 = u^2 + 2 a s\n- s = (u + v)/2 × t (average velocity × time)\nUse signs carefully: choose positive direction and stick to it. Acceleration opposite to\nvelocity gives negative acceleration (deceleration).\n\n\n4. Graphical analysis (displacement, velocity, acceleration)\nPosition-time (s-t) graph:\n- Gradient = velocity.\n- Straight line = constant velocity; curve = changing velocity.\nVelocity-time (v-t) graph:\n- Gradient = acceleration.\n- Area under v-t graph = displacement.\nAcceleration-time (a-t) graph:\n- Area under a-t graph = change in velocity.\nKCSE tip: practice finding gradients and areas from simple shapes (rectangles,\ntriangles).\n\n\n5. Free-fall & vertical motion near Earth's surface\nAcceleration due to gravity g ≈ 9.8 m s■² (KCSE often uses 9.8 or 10; check question\ninstruction).\nDownwards acceleration is +g if downward chosen positive (or −g if upward positive).\nEquations are same SUVAT with a = g for freely falling objects or a = −g for upward\nmotion under gravity.\nExamples:\n- Time to fall from height h: h = 0.5 g t^2 → t = √(2h/g) (starting from rest).\n- Maximum height of projectile with initial vertical component u_y: h_max = u_y^2/(2g).\n\n\n6. Newton's First Law (Inertia)\nAn object remains at rest or in uniform motion in a straight line unless acted on by a\nnet external force. Introduces concept of inertia and inertial frames. If net force = 0\n→ acceleration = 0.\n\n7. Newton's Second Law (F=ma)\nNet force F (vector) on a body is proportional to the rate of change of its momentum.\nFor constant mass: F = m a (SI units: N = kg × m s■²).\nUse vector form and resolve forces along chosen axis. For multiple forces along same\nline, algebraic sum (consider signs) = m a.\nBe careful with direction: if forces oppose each other, subtract to get net force.\n\n\n8. Newton's Third Law (action & reaction)\nFor every action force there is an equal and opposite reaction force. Action and\nreaction act on different bodies and do not cancel each other.\nExamples: book on table (book pushes table down; table pushes book up with equal\nreaction).\n\n\n9. Free-body diagrams & solving problems\nDraw all forces acting on the object as vectors: weight (W = m g) acting down, normal\nreaction (R) perpendicular to contact surface, friction (f) opposite motion, tension (T)\nalong string, applied forces.\nResolve forces along chosen axes (parallel and perpendicular to surface).\nSet ΣF = m a along axis of motion, and ΣF_perp = 0 to find normal reaction when no\nacceleration perpendicular to surface.\n\n\n10. Friction (static & kinetic)\nFriction opposes relative motion between surfaces.\nStatic friction f_s ≤ µ_s R (adjusts up to a maximum) — prevents motion.\nKinetic (sliding) friction f_k = µ_k R (often approximately constant when sliding).\nµ_s and µ_k are coefficients of friction (dimensionless), usually µ_s > µ_k.\nR is normal reaction (often = mg cosθ on an incline).\n\n\n11. Inclined planes\nFor a block on an incline of angle θ (with no acceleration perpendicular):\n- Weight components: parallel to plane = mg sinθ (down the slope), perpendicular = mg\ncosθ.\n- Normal reaction R = mg cosθ (if no vertical acceleration).\nIf block slides, net parallel force = mg sinθ − f = m a (choose direction down slope\npositive).\n\n\n12. Momentum & Impulse\nMomentum p = m v (vector; kg m s■¹). Conservation of momentum: For isolated system (no\nexternal net force) total momentum before = total momentum after.\nImpulse J = ∆p = F_avg × ∆t (Ns). Impulse equals area under force-time graph.\nUse for collision and explosion problems: elastic vs inelastic collisions (energy\nconsiderations differ).\n\n\n13. Work, energy & power (brief)\nWork done by constant force F over displacement s in direction of force: W = F s cosθ\n(J).\nKinetic energy: KE = 0.5 m v^2. Potential energy (gravitational near Earth): PE = m g h.\nWork-energy theorem: Net work done = change in kinetic energy.\nPower: P = W/t = F v (instantaneous if force and velocity aligned).\n\n\n14. Simple examples & worked questions\n1) A car accelerates uniformly from rest to 20 m s■¹ in 10 s. Find acceleration and\ndistance travelled.\n- a = (v − u)/t = (20 − 0)/10 = 2.0 m s■².\n- s = ut + 0.5 a t^2 = 0 + 0.5 × 2 × 10^2 = 100 m.\n2) A 2.0 kg block on a horizontal surface is pulled with 15 N; friction opposing is 5 N.\nFind acceleration.\n- Net force = 15 − 5 = 10 N. a = F/m = 10/2 = 5.0 m s■².3) Ball dropped from 45 m. Using g = 9.8 m s■², find time to hit ground.\n- h = 0.5 g t^2 → t = √(2h/g) = √(90/9.8) ≈ 3.03 s.\n\n\n15. Common problem types & tips\n- Always choose coordinate axes and stick to sign convention.\n- Carefully draw free-body diagram before writing equations.\n- For collisions, check if external forces (like friction) are negligible when applying\nconservation of momentum.\n- When using SUVAT, ensure acceleration is constant; split motion into segments if\nacceleration changes.\n- For inclined planes, resolve weight into components mg sinθ and mg cosθ.\n\n\n16. Small practicals & experiments (KCSE style)\n1) Measure acceleration using a trolley and a light gate or ticker tape: measure times\nand displacements, plot v vs t to find acceleration.\n2) Investigate motion on an incline: measure acceleration for different angles and\nverify a ≈ g sinθ (if friction negligible).\n3) Elastic collision demonstration with dynamics cards on a track (measure velocities\nbefore and after using light gates).\n\n\n17. Typical numerical values & constants\n- g = 9.8 m s■² (KCSE sometimes allows 10 m s■² if stated).\n- µ (coefficients) vary: rough estimates: µ_k ~ 0.1–0.6 depending on surfaces.\n- 1 N = 1 kg m s■².\n\n\n18. Exam tips & common mistakes to avoid\n- Forgetting vector nature: don't add magnitudes without considering direction.\n- Mixing up speed and velocity.\n- Incorrect sign use in SUVAT equations (careful with initial/final velocities and\ndirection).\n- Not checking units: always include units in final answer.\n- For multi-part problems show intermediate steps (method marks).\n\n\n19. Summary & quick reference\nKey formulas:\n-v=u+at\n- s = u t + 0.5 a t^2\n- v^2 = u^2 + 2 a s\n-F=ma\n- Weight W = m g\n- Momentum p = m v\n- Impulse J = ∆p = F ∆t\n- Work W = F s cosθ; KE = 0.5 m v^2; PE = m g h\nPractice 8–10 past KCSE mechanics questions, focus on free-body diagrams and consistent\nsign convention."
    },
    {
      "id": 6,
      "title": "Physics — Electricity & Magnetism-Contents: Current, circuits, magnetism, induction, transformers, experiments, formulas",
      "content": "Physics — Electricity & Magnetism-Contents: Current, circuits, magnetism, induction, transformers, experiments, formulas\n1. Overview\nThis booklet covers the essentials of Electricity and Magnetism for KCSE Form 4:\nelectric current, potential difference (voltage), resistance, Ohm's law, series and\nparallel circuits, electromotive force and internal resistance, electrical power and\nenergy, magnetic fields, electromagnetism, electromagnetic induction (Faraday & Lenz),\ntransformers, generators and motors. Includes key formulas, experiments, and exam tips.\n\n\n2. Electric charge, current & conventional direction\nElectric charge (Q) measured in coulombs (C). Electron charge e ≈ 1.60×10^-19 C.\nElectric current (I) = rate of flow of charge: I = Q/t (amps, A).\nConventional current direction is from positive to negative (opposite to electron flow).\nCharge carriers in metals are electrons; in electrolytes ions carry charge.\n\n\n3. Potential difference (Voltage) & EMF\nPotential difference (V or V) between two points: work done per unit charge moving a\ncharge between the points: V = W/Q (volts, V).\nElectromotive force (ε, EMF) is the energy supplied per unit charge by a source\n(battery) in moving charge around a complete circuit (open-circuit). Measured in volts.\nInternal resistance (r): real batteries have internal resistance; terminal voltage V = ε\n− Ir when delivering current I.\n\n\n4. Resistance & Ohm's Law\nResistance (R) measures opposition to current (ohms, Ω). Ohm's law: V = IR (holds for\nohmic conductors at constant temperature).\nResistivity (ρ): R = ρL/A where L is length and A cross-sectional area. Units: Ω·m.\nTemperature dependence: for metals R increases with temperature; for semiconductors R\ndecreases with temperature.\n\n\n5. Series & Parallel Circuits\nSeries:\n- Current same through components: I_total = I1 = I2 ...\n- Voltage splits: V_total = V1 + V2 + ...\n- Equivalent resistance: R_eq = R1 + R2 + ...\nParallel:\n- Voltage same across branches: V = V1 = V2 ...\n- Currents split: I_total = I1 + I2 + ...\n- Reciprocal rule: 1/R_eq = 1/R1 + 1/R2 + ... (for two: R_eq = R1 R2/(R1+R2)).\nPower in circuits: P = VI = I^2 R = V^2 / R.\n\n\n6. Electrical energy & units\nElectrical energy: E = V Q = V I t (joules, J). Often expressed in kilowatt-hours (kWh)\nfor appliances: 1 kWh = 3.6×10^6 J.\nPower rating: P (watts) = V I. Appliances list power (e.g., 1000 W kettle).\n\n\n7. Measuring current & voltage (practical tips)\nAmmeter: placed in series with the component; must have low resistance.\nVoltmeter: placed in parallel across component; must have high resistance.\nWhen measuring battery EMF and internal resistance set up to measure terminal voltage at\ndifferent currents, plot V vs I; gradient = −r, intercept = ε.\n\n\n8. Kirchhoff's laws (basic use)\n1) Junction rule (conservation of charge): sum of currents into a junction = sum out.\n2) Loop rule (conservation of energy): sum of emf = sum of drops (IR) around a closed\nloop. Useful when circuits contain multiple batteries and resistors.\n\n\n9. Magnets & magnetic fields\nMagnetic field lines show direction and strength (closer lines = stronger field). Field\ndirection: from north (N) to south (S) outside magnet.\nField of a long straight wire: B = (µ0 I)/(2π r) (for ideal long straight conductor). µ0\n= 4π×10^-7 T·m/A.\nField inside a long solenoid: B = µ0 n I (n = turns per unit length).\n\n\n10. Force on a current-carrying conductor (motor effect)\nWhen a current-carrying conductor of length L in a magnetic field B experiences a force:\nF = B I L sin θ (θ angle between current direction and field).\nDirection given by Fleming's left-hand rule (Force, Field, Current).\nTorque on rectangular coil in motor: τ = N I A B (approx), where N turns and A area.\n\n\n11. Magnetic flux & flux linkage\nMagnetic flux (Φ) = B ⋅ A ⋅ cos θ (weber, Wb). Magnetic flux linkage for a coil with N\nturns: NΦ.\nChange in flux linkage with time induces EMF (Faraday's law).\n\n\n12. Electromagnetic induction — Faraday & Lenz\nFaraday's law: Induced emf magnitude = |d(NΦ)/dt|. For single loop ε = |dΦ/dt|.\nLenz's law: The direction of induced emf/current is such that it opposes the change in\nflux that produced it (conservation of energy).\nPractical examples: moving magnet through coil induces pulse; AC generators produce\nalternating emf by rotating coil in magnetic field.\n\n\n13. Simple generator & alternator\nAC generator: rotating coil in magnetic field; induced emf ε = N B A ω sin(ωt) (for\nuniform rotation). Frequency f = ω/(2π).\nSlip rings deliver alternating emf.\nDC generator uses commutator to rectify output to direct current.\n\n\n14. Transformers\nOperate on alternating current using electromagnetic induction. Ideal transformer\nequations:\n- V_p / V_s = N_p / N_s (primary to secondary voltages proportional to turns ratio)\n- I_p / I_s = N_s / N_p (currents inversely proportional)\n- P_in ≈ P_out (ideal, neglecting losses): V_p I_p ≈ V_s I_s.\nUsed to step-up (N_s > N_p) or step-down voltage for transmission. Requires AC; not\noperate with DC.\n\n\n15. Eddy currents & core losses (brief)\nChanging flux in conducting cores induces circulating currents (eddy currents) causing\nheating and energy loss. Laminated cores or use of soft iron reduces eddy currents.\nHysteresis losses in magnetic materials also waste energy.\n\n\n16. Applications: motors, generators, transformers, electromagnets\nMotor: converts electrical energy to mechanical via force on current-carrying coil in\nmagnetic field.\nGenerator: converts mechanical energy to electrical.\nElectromagnets: coil carrying current around soft iron core concentrates field and can\nbe switched on/off; used in relays, cranes, loudspeakers.\n\n\n17. Safety & practical advice\n- Always start with low voltage when building circuits; double-check connections before\nswitching on.\n- High currents cause heating; use appropriate resistors and fuses.\n- Transformers and mains voltages are dangerous — handle only under supervision.- When demonstrating induction, keep hands and metal objects clear of rapidly changing\nflux to avoid eddy current heating.\n\n\n18. Key formulas summary\nI = Q/t\nV = W/Q, V = IR\nR = ρL/A\nSeries: R_eq = R1 + R2 + ...; Parallel: 1/R_eq = 1/R1 + 1/R2 + ...\nP = VI = I^2R = V^2/R\nMagnetic field of wire: B = µ0 I/(2π r)\nForce on conductor: F = BIL sin θ\nMagnetic flux: Φ = B A cos θ\nFaraday: ε = |dΦ/dt| (or |d(NΦ)/dt|)\nTransformer: Vp/Vs = Np/Ns\n\n\n19. Typical practicals & observations (KCSE style)\n1) Ohm's law verification: measure V and I for resistor; plot V vs I; slope = R (for\nohmic conductor).\n2) Internal resistance of cell: measure terminal V at different currents; plot V vs I;\nintercept = ε, gradient = −r.\n3) Magnetic field mapping: use compass to trace field lines around bar magnet or\ncurrent-carrying wire.\n4) Demonstrate electromagnetic induction: move magnet through coil and detect induced\np.d. on galvanometer; reverse motion reverses sign.\n\n\n20. Worked examples (short)\n1) A 12 V battery with internal resistance 0.5 Ω is connected to a resistor of 5.5 Ω.\nFind current and terminal voltage.\n- Total R = 5.5 + 0.5 = 6.0 Ω; I = ε/(R_total) = 12/6 = 2.0 A. Terminal V = ε − I r =\n12 − 2×0.5 = 11 V.\n2) A coil of 50 turns, area 0.02 m^2, perpendicular to a uniform B=0.10 T. If field is\nswitched off to zero in 0.01 s, find average induced emf.\n- Initial flux NΦ = 50 × 0.10 × 0.02 = 0.1 Wb. Final = 0. Change = 0.1 Wb in 0.01 s.\nε_avg = ∆(NΦ)/∆t = 0.1/0.01 = 10 V.\n\n\n21. Exam tips & common mistakes\n- Always state units and include sign for emf/∆Φ where relevant.\n- Distinguish between emf (ε) and terminal voltage (V).\n- Use correct rules for series/parallel when simplifying circuits.\n- For magnetic direction questions use left-hand/right-hand rules and be clear which is\nwhich (motor vs generator).\n- When using Faraday/Lenz mention opposition to change in flux (reason the induced\ncurrent flows).\n\n\n22. Quick revision checklist\n- Memorise key formulas: I=Q/t, V=IR, P=VI, F=BIL, Φ=BA, Faraday (ε = dΦ/dt),\ntransformer relations.\n- Practice circuit calculations (series and parallel) and plotting V vs I for resistors\nand cells.\n- Do 4 past KCSE questions on internal resistance, magnetic fields and electromagnetic\ninduction.\n- Be comfortable sketching simple field patterns and circuit diagrams."
    }
  ]
}